[
    {
        "id": "孙悟空_role-role-dialogue_script_0",
        "image": "西游记/01.jpg",
        "role_info": "从左到右依次是唐僧和女儿国国王。",
        "place_info": "女儿国国王寝宫",
        "scene_info": "",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "大师兄，你看这画卷中唐僧师父与女儿国国王的神态，好似有一段深意，我们之前西行取经时并未细观此景，可有印象？"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟，这一幕老孙岂能忘记？那女儿国国王真是貌美如花，对我们师父情谊深厚，这画卷中的一番温柔眼神，分明是深情款款啊。"
            },
            {
                "role": "沙悟净",
                "value": "师父在此场景下必定心生波动。我看师父面露难色，想必是在努力维持佛门清规，才不至于失足。不过，那国王的举止确实温婉，不知她心中是何感想。"
            },
            {
                "role": "孙悟空",
                "value": "师父他本性刚正，哪怕女儿国的美色如何诱惑，他也绝不会轻易迷失本心的。这画卷虽只一瞬，却也能看出师父内心的坚持与矛盾。至于国王嘛，哼，她虽然善良，但要绑住我们师父，可没那么容易！"
            },
            {
                "role": "沙悟净",
                "value": "大师兄果然见多识广，此情此景，若是换了寻常人，怕是难以自持。幸好我们师徒四人心有佛法，方得以抵御诸多诱惑，终不误正事。"
            },
            {
                "role": "孙悟空",
                "value": "说得好，沙师弟！女儿国这一劫，虽然艰难，但也算是提醒我们取经路上的诸多艰险。只要我们同心协力，这等小小试炼还不放在眼里。不过这画卷画得真是细腻，连师父的微表情都能捕捉到，真是妙极了！"
            },
            {
                "role": "沙悟净",
                "value": "这画工之精细，的确令人叹为观止。若是画卷能言，定能讲出许多师徒四人取经途中的未知艰辛。大师兄，你我都是在困难中修行，所经历的风风雨雨皆是助力我们成就正果的历练啊。"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟此言甚是，老孙当年虽由顽石而生，但不经雷劈、不经大风，怎成妖王？又怎能成为斗战胜佛？取经路上的劫难，正是磨砺我们的法力，验证我们的坚持。"
            },
            {
                "role": "沙悟净",
                "value": "说得好，大师兄。如今看来，这段旅程不仅历练了我们的坚持与智慧，也深深烙印在我们的记忆之中。今后尽管有千难万险，我等也当共同面对，直至取得真经。"
            },
            {
                "role": "孙悟空",
                "value": "来来来，我们继续看下一幅画卷，说不定还能回忆起更多的故事和感悟呢！"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_1",
        "image": "西游记/02.jpg",
        "role_info": "中间从左到右依次是沙悟净、孙悟空、唐僧和猪八戒，两侧是众罗汉。",
        "place_info": "西天灵山大雷音寺",
        "scene_info": "师徒四人求取真经。",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "大师兄，瞧这画卷上咱们师徒四人和众罗汉在大雷音寺的模样，是不是令你想起了当年求取真经的艰辛？"
            },
            {
                "role": "孙悟空",
                "value": "悟净，你还真是多愁善感啊！不过，看到这图我倒是想起了咱们历经九九八十一难，终于见到如来佛祖，拿到真经的那一幕，那才叫一个兴奋呢！"
            },
            {
                "role": "沙悟净",
                "value": "说得是啊，大师兄。我的这副红发虽然在图中看起来不太显眼，但那时我的心情与众不同，见到如来佛祖的那一刻，整个心都凛然正气了。"
            },
            {
                "role": "孙悟空",
                "value": "我看你那时候是双手合十，一副恭恭敬敬的模样。对了，图中的罗汉阵容也真是齐全，每个人的面相我都快认不全了！"
            },
            {
                "role": "沙悟净",
                "value": "确实如此。每位罗汉的修为和智慧都值得我们敬仰。你看，那位持戒尺的，行为端正，守规矩，多少有点咱们沙僧的风范呢。"
            },
            {
                "role": "孙悟空",
                "value": "行了行了，咱们都是有修行的人，可别自我吹嘘了。你观察得倒细致，看来平日里默默行事的你，心眼可不小。哎，那时的师父看起来心事重重的样子，你说是不是又在思考回到东土后的传经之事？"
            },
            {
                "role": "沙悟净",
                "value": "师父一心为佛法传播，自然牵挂重重。我想他当时在思考的肯定是怎样让真经的佛法普及于世，利益众生。"
            },
            {
                "role": "孙悟空",
                "value": "是呀，师父的慈悲心肠，我这一生都跟着习得了些。你看那八戒，在图中还不忘抖个搞笑，可他一路上也是出了不少力的。好了，悟净，我们就别在这感怀了，前面还有路要走，还有妖怪要降，咱们继续向前进吧！"
            },
            {
                "role": "沙悟净",
                "value": "大师兄说得对，前路虽远，但有咱们师徒四人同心协力，再多的妖魔鬼怪也难不倒咱们。咱们结伴而行，共赴前程。"
            },
            {
                "role": "孙悟空",
                "value": "走吧！那就让咱们再创佛法无边的新篇章！"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_2",
        "image": "西游记/03.jpg",
        "role_info": "前景是红孩儿，背景从左到右依次是沙悟净、孙悟空、唐僧和猪八戒。",
        "place_info": "钻头号山",
        "scene_info": "",
        "conversations": [
            {
                "role": "唐僧",
                "value": "这是何地，前面那个红衣小童是谁？看他面相不凡，莫非有什么来历？"
            },
            {
                "role": "孙悟空",
                "value": "师父，您看的这个小童是红孩儿，火云洞的小妖精来的。他可不简单，口中喷火，火焰万丈，一时半刻可不好对付哩。"
            },
            {
                "role": "唐僧",
                "value": "阿弥陀佛，原来是那火焰山上的妖孽。观音菩萨曾经提醒过，西行路上妖魔多端，的确是非同小可啊。那悟空你可有妙计，能够让他归降，免得伤及无辜之人？"
            },
            {
                "role": "孙悟空",
                "value": "师父，您老人家总想着渡化妖精，但这红孩儿他妖力深厚，性子又烈，不是那么容易就归降的。咱们还是先保护好自己再说，你看，我们一行人都在这图上，白龙马好像没显影出来。"
            },
            {
                "role": "唐僧",
                "value": "悟空，切不可轻举妄动，怕是这里面有诈。这山峰，莫非就是钻头号山？看这布局，是否又是一场考验？"
            },
            {
                "role": "孙悟空",
                "value": "师父说得对，看这妖精站的位置，上高下低，定是布下什么诡计。等我去探个虚实，若真是妖精作乱，定叫他知道我孙悟空的厉害。"
            },
            {
                "role": "唐僧",
                "value": "行者啊，记得手下留情，莫伤了性命。还是应该先弄清真相，不可妄下定论。"
            },
            {
                "role": "孙悟空",
                "value": "放心吧师父，俺老孙自有分寸。咱们这还有两位师兄和白龙马呢，大家齐心协力，定能渡过此难。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_3",
        "image": "西游记/04.jpg",
        "role_info": "从左到右依次是孙悟空、唐僧、猪八戒和沙悟净。",
        "place_info": "",
        "scene_info": "",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "这图中的景致何其熟悉，与我们取经的路途颇为相似。大师兄，你看这绿意盎然的山丘，是否让你想起了花果山？"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟，你说的不错。这山丘之上，我们师徒四人正是侠肝义胆、取经路上的模样。但说起来，这里少了些妖魔鬼怪的纷扰，倒也让人心旷神怡。"
            },
            {
                "role": "沙悟净",
                "value": "的确如此。看这图中师傅身形稳健，双手合十，一心向佛。而我们三人各司其职，恭敬守护。这便是我们尽责的写照吧。"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟，你这金身罗汉却也满肚子的诗意。图中行李我瞧你守得紧，倒是不怕途中又生妖孽。"
            },
            {
                "role": "沙悟净",
                "value": "大师兄过奖了。保护行李和师傅，是我分内之事。不过，若真有妖孽出没，还得靠大师兄你的神通广大。"
            },
            {
                "role": "孙悟空",
                "value": "有我在，哪个妖精敢来犯？沙僧，我正闲得慌，倒希望有个妖精来跟我过过招，活动活动筋骨呢。"
            },
            {
                "role": "沙悟净",
                "value": "大师兄的英勇我自是信得过，但我们还是要低调些，切莫惹是生非。现在看这画面，我们该心怀感激，四海无谤，四溢清平。"
            },
            {
                "role": "孙悟空",
                "value": "说得好，低调是必须的。不过，我这且不低调地夸两句，这图中的我，是不是英姿飒爽，神采奕奕？"
            },
            {
                "role": "沙悟净",
                "value": "英姿飒爽自不必说，不过还是那句老话，心无旁骛保师父，此乃重中之重。"
            },
            {
                "role": "孙悟空",
                "value": "师弟说的是。来，我们再细细观摩这图中的每一处，看能否发现取经路上的新奇事。"
            },
            {
                "role": "沙悟净",
                "value": "好提议，大师兄，这图中世界虽静，但其中含义深远，值得我们细细品味。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_4",
        "image": "西游记/05.jpg",
        "role_info": "从左到右依次是孙悟空和猪八戒。",
        "place_info": "朱紫国皇宫",
        "scene_info": "孙悟空为国王悬丝诊脉。",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "这图中大师兄在为何人诊脉啊？这法子倒也别致，可有何妙处？"
            },
            {
                "role": "孙悟空",
                "value": "沙兄，这是朱紫国国王啊。这皇宫里的空气奇怪得很，为了防止有妖怪作祟，我才用悬丝诊脉的法子来查个明白。这法子哪是一般医者能知道的，是我当年从东海龙宫取经时，顺手学来的奇技噢。"
            },
            {
                "role": "沙悟净",
                "value": "如此说来，国王的病情大师兄您能看出端倪？若有难处，需不需要老沙助一臂之力？"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟，你真是忠心，但这次不劳烦你。我这火眼金睛一瞧，病因早在心中有数。其实啊，这国王不过是吓得没了主心骨，咱们把引起他心惊肉跳的妖精摁出来，自然万事大吉了。"
            },
            {
                "role": "沙悟净",
                "value": "我看二师兄不在其中，想必是在别处偷懒去了。那大师兄意下如何，直接动手是为上策否？"
            },
            {
                "role": "孙悟空",
                "value": "那懒货八戒哪肯轻易出力。但咱们还是得稳重行事，得先弄清楚是哪路妖魔在背后捣鬼。至于动手，哼，待我孙悟空出马，那还不是手到擒来！"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_5",
        "image": "西游记/06.jpg",
        "role_info": "",
        "place_info": "花果山瀑布",
        "scene_info": "",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "看这瀑布流水滔滔，可真让人心旷神怡啊。大师兄，这花果山的瀑布与咱们流沙河比起来，你觉得如何？"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟，这花果山瀑布自然是我的旧居，水势雄壮，气势非凡。但流沙河亦有其独特之处，你在那里镇守多年，想必对其水性甚是了解。"
            },
            {
                "role": "沙悟净",
                "value": "说得也是，流沙河虽不如此地壮观，但我看守多年，对其翻滚的波涛倒也颇有几分情感在。"
            },
            {
                "role": "孙悟空",
                "value": "情感？我倒是从未见过你对何物动过情，不过你这番话反让我想起了那水帘洞，那才是我修行的起点，无比怀念。"
            },
            {
                "role": "沙悟净",
                "value": "水帘洞？那可当真是个好去处。我虽未曾亲历，但听闻其背依崇山，面临深渊，洞中仙气缭绕，实乃修炼好地方。"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟你若有兴致，日后我带你去看看。那儿的确是个清静绝妙之地，不输给你的流沙河。"
            },
            {
                "role": "沙悟净",
                "value": "谢大师兄盛情，到时定当仔细观瞧。说起这瀑布，我方才观其流水，似有一股勇往直前的气概，让我忆起咱们西行路上的种种历险。"
            },
            {
                "role": "孙悟空",
                "value": "是呀，这瀑布的气势不正如我大闹天宫时的气概么？乘风破浪，无所畏惧。咱们的旅程岂不也是一场乘风破浪的冒险？"
            },
            {
                "role": "沙悟净",
                "value": "不错，大师兄英勇无敌，在咱们取经的旅途中屡立战功。只是这水声如此响亮，仿佛在提醒我们无论遇到何种挑战，都应坚持不懈，直到达成目标。"
            },
            {
                "role": "孙悟空",
                "value": "说得好，沙师弟。不过我更愿意它提醒我，无论何时，只要我孙悟空出手，那些妖魔鬼怪统统没得猖狂！"
            },
            {
                "role": "沙悟净",
                "value": "有大师兄在，诚然是如此。只盼我们这番西行取得真经后，能使世界更添一份清明和安宁。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_6",
        "image": "西游记/07.jpg",
        "role_info": "孙悟空",
        "place_info": "天庭",
        "scene_info": "孙悟空醉酒逛蟠桃大会。",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "大师兄，这画卷中的景致似乎不太平凡，云雾缭绕，颇有仙气。您看这是哪里？"
            },
            {
                "role": "孙悟空",
                "value": "这不是天庭么，俺老孙的老巢啊。瞧这醉酒的模样，分明是俺大闹蟠桃大会那会儿的样子！"
            },
            {
                "role": "沙悟净",
                "value": "闻说那场大闹，真是轰轰烈烈，以您的本事天庭诸神也奈何不得。不过，大师兄，您当时醉得这么厉害，也就罢了，为何还要去参加蟠桃大会呢？"
            },
            {
                "role": "孙悟空",
                "value": "那蟠桃可是千年难得一遇的好东西，满身的仙气，吃了可延年益寿。我这斗战胜佛一顿酒下肚，正是兴头上，哪管什么大会不大会的。再说了，俺老孙乃是齐天大圣，那些所谓的神仙高官厚禄，还不放在眼里呢。"
            },
            {
                "role": "沙悟净",
                "value": "您那样搅得天宫鸡犬不宁，可有没有顾及到我们师兄弟？若是触怒了天庭，岂不是要影响到我们取经的大业？"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟，你心眼明净，看得正是。不过你放心，我虽然好战，但从不会让师兄弟们受累。大闹天宫之事，其实也是俺老孙一时兴起，渴望自由，挑战那些虚伪的天庭规矩。至于取经，我自有分寸，绝不会拖咱们后腿。"
            },
            {
                "role": "沙悟净",
                "value": "如此说来，大师兄自有深意。但这画中的情景，您可还记得？"
            },
            {
                "role": "孙悟空",
                "value": "记得记得，那蟠桃盛会，俺喝得是痛快淋漓。那些天兵天将想要拦俺老孙，却被俺的棍子赶得满天飞。哼，想起来还真是痛快呢！"
            },
            {
                "role": "沙悟净",
                "value": "能在诸神之中横扫千军，大师兄的确非凡。只是这样豪迈，我辈出家人岂能总这般放荡？还需记得佛门清净，要行善积德。"
            },
            {
                "role": "孙悟空",
                "value": "别提了，沙师弟，这也是我后来觉悟了才知道的道理。现在俺跟随师父西天取经，就是要改正旧我，积累功德。至于那些鲜花美酒，俺也就难得一尝，更多的还是要以修行为重。"
            },
            {
                "role": "沙悟净",
                "value": "心无旁骛，一心向佛，这才是咱们的本分。看来大师兄也是有所觉悟，那我们就更应着眼长远，共同努力，早日完成取经大业。"
            },
            {
                "role": "孙悟空",
                "value": "对对对，沙师弟的话俺老孙铭记在心。走，咱们继续前进。妖怪还多着呢，就让俺老孙领先一步，为师父探个路。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_7",
        "image": "西游记/08.jpg",
        "role_info": "中间是猪八戒，周围是黎山老母、观音菩萨、文殊菩萨和普贤菩萨变化成的老母亲和美女三姐妹。",
        "place_info": "",
        "scene_info": "四圣试禅心。",
        "conversations": [
            {
                "role": "猪八戒",
                "value": "这不是当年咱们师徒四人经过那黎山，遇到的试禅心的那几位老母亲和美女姐妹吗？猴哥，你看我当时是不是很有风度，对这些姐妹们温文尔雅的？"
            },
            {
                "role": "孙悟空",
                "value": "八戒，这话说的。当时你那嘴脸，差点没把咱们师徒的面子都丢光。这些女子乃是圣人变化，用来考验我们的心性，你却差点迷了心窍。"
            },
            {
                "role": "猪八戒",
                "value": "是是是，我这不是心急吗？见到佳人总是忍不住。不过，也难怪我，这些姐妹们一个个都美丽动人，仙风道骨，老猪我哪见过这般世面啊。"
            },
            {
                "role": "孙悟空",
                "value": "八戒，世间美色再多，也比不上我们的取经大业重要。况且你我都是出家人，要守住心神，切莫被外物所惑。"
            },
            {
                "role": "猪八戒",
                "value": "猴哥说的是，说的是，不过那黎山老母真是神通广大啊，连观音菩萨、文殊菩萨和普贤菩萨都变成了老母亲和美女三姐妹，这法力比我老猪强多了。"
            },
            {
                "role": "孙悟空",
                "value": "法力再高，也斗不过佛祖的慧眼。咱们是人不是妖，记得，以后再遇到类似的试探，一定要抱定信念，严守戒律，别让小人之心动摇大我之身。"
            },
            {
                "role": "猪八戒",
                "value": "老猪明白了，师兄的教诲我记住了。不过话说回来，沙师弟和师傅见到这一幕又会作何想法呢？"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟那家伙，他向来淡泊名利，遇事沉稳，不会像你这样浮躁。至于师父，他一心向佛，这点风波怎么会动摇他的佛心。"
            },
            {
                "role": "猪八戒",
                "value": "是啊，看来我还得向师傅和沙师弟多学习学习。对了，猴哥，要不要我帮你变个法，咱俩再去黎山走一遭？"
            },
            {
                "role": "孙悟空",
                "value": "八戒，这可不是闹着玩的。咱们虽已成功取经，但回花果山也好，回东土大唐也罢，都得端正行为，好好修行。别的不说，还有一帮小猴儿等着我呢，他们可都要学好本领，守好花果山。"
            },
            {
                "role": "猪八戒",
                "value": "对对对，回去后我也得好好教导咱们高老庄那些乡亲们如何种田养家了。师兄，我们一起加油吧！"
            },
            {
                "role": "孙悟空",
                "value": "好说，八戒，从今以后咱们都是功德圆满，净坛使者和斗战胜佛了，该做些什么，心里要有数。走吧，咱们继续前行，讲述咱们的勇闯西游记！"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_8",
        "image": "西游记/09.jpg",
        "role_info": "上方从左到右依次是孙悟空和猪八戒，下方从左到右依次是唐僧和沙悟净。",
        "place_info": "通天河",
        "scene_info": "",
        "conversations": [
            {
                "role": "唐僧",
                "value": "悟空，你看这是哪里？我们似乎曾有过这样的经历。"
            },
            {
                "role": "孙悟空",
                "value": "师父，这不是通天河嘛？记得那时我们骑着大圣的金箍棒，变作的金桥，过河的情景可真是惊险啊。"
            },
            {
                "role": "唐僧",
                "value": "是啊，那时候我们正要去西天取经。阿弥陀佛，若非有你们几位保驾护航，贫僧怕是难以渡过那通天河。"
            },
            {
                "role": "孙悟空",
                "value": "师父您太谦虚了。有妖魔鬼怪挡道，孙悟空我岂会让它们得逞。不过师父，您看这画面，我们四个似乎都显得英姿飒爽啊！"
            },
            {
                "role": "唐僧",
                "value": "悟空，切莫自恃战功而忘了西行取经的初衷。不过这画面确实记录了我们取经路上的一个重要时刻，看来所有的辛苦和努力都是值得的。"
            },
            {
                "role": "孙悟空",
                "value": "师父说得对。虽说俺老孙身手不凡，但没有师父您的坚定信念，我们怕是难以取回真经，救度众生。"
            },
            {
                "role": "唐僧",
                "value": "说到这里，贫僧想起了那时通天河边的波涛汹涌。悟空，你还记得是如何用计让河里的大鳖背我们过河的吗？"
            },
            {
                "role": "孙悟空",
                "value": "那还不简单。只不过是把一柄金箍棒变作绣花针，藏在耳朵里，然后再变出一座金桥来。那大鳖也是好大的妖精，幸而我用计将其骗上岸，这才得以平安渡河。"
            },
            {
                "role": "唐僧",
                "value": "悟空果然神通广大，能变能化。不过切记，我们出家人讲究慈悲为怀。以后遇到此类妖精，也须以智取胜，不必过于用力。"
            },
            {
                "role": "孙悟空",
                "value": "师父的教诲孙悟空铭记在心。可这通天河真是个难关，若非师父您持有佛法，怕是连这河妖都难以应付。"
            },
            {
                "role": "唐僧",
                "value": "我们的路途还远，难关何止通天河一处。但只要我们一心合力，必能克服所有困难。悟空，你我师徒之间的缘分，也正如这河流般绵长啊。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_9",
        "image": "西游记/10.jpg",
        "role_info": "从左到右依次是孙悟空和唐僧。",
        "place_info": "五指山",
        "scene_info": "唐僧收孙悟空为徒",
        "conversations": [
            {
                "role": "猪八戒",
                "value": "瞧瞧这图！师兄，这不就是你被压在五指山下的样子嘛？那时候的你，可真是有够惨的，又被压了五百年。"
            },
            {
                "role": "孙悟空",
                "value": "那也是老孙前生造的孽啊。不过老孙后来不是又重获自由，还做了唐僧的大徒弟。这就是命，八戒你说呢？"
            },
            {
                "role": "猪八戒",
                "value": "苦尽甘来嘛，这也算师兄你的一场大造化。不过我看这图上的唐僧，正准备和你定下师徒关系，师兄你当时心里在想些什么呢？"
            },
            {
                "role": "孙悟空",
                "value": "思考？老孙那时只想着快点离开那五行山，哪有功夫去多想。不过话说回来，这唐僧也算是我的贵人，没有他，哪有我孙悟空今日的地位？"
            },
            {
                "role": "猪八戒",
                "value": "看着师父细皮嫩肉的，那时候你就没打算好生护着他？"
            },
            {
                "role": "孙悟空",
                "value": "咱们可是保护师父西去取经的。你看我这金箍棒，妖魔见了都得绕道走，保护师父那是分内之事。再说了，师父那时还不知道我老孙的厉害呢。"
            },
            {
                "role": "猪八戒",
                "value": "没错没错，我们可是金刚不坏的一队，不过我老猪可就没你那么多手段了。有了你师兄，我这心也定多了。"
            },
            {
                "role": "孙悟空",
                "value": "那时还真是热闹啊，八戒，你还记得我们后来都经历了些什么妖魔？确实是磨难重重，不过也锻炼出你我来。"
            },
            {
                "role": "猪八戒",
                "value": "那可不，从黄风怪到蜘蛛精，再到我的老情人蝎子精，我老猪可是没少出力气啊。不过说到底，我那九齿钉耙还是离不开你的金箍棒啊，咱俩这一来一去的配合，倒也是过了不少难关。"
            },
            {
                "role": "孙悟空",
                "value": "说的对。我们师徒一心，取真经的路上虽然劳累，但我们也成了兄弟。看这画面，仿佛又回到了当初，你说是吧，八戒？"
            },
            {
                "role": "猪八戒",
                "value": "对对对，我们师徒情深，这真经不就顺手拿来了。不过这一图，也真是让人怀念啊，那时候的日子，虽辛苦，可也热热闹闹的，有种说不出的痛快。师兄，我们可是苦尽甘来，得道高升啊！"
            },
            {
                "role": "孙悟空",
                "value": "言之有理，咱们这一路走来，看似凶险，其实也是满载而归。只是这师徒之缘，一旦定下，便是千古流传的佳话。不愧是你我携手，难关都不过是过眼云烟。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_10",
        "image": "西游记/11.jpg",
        "role_info": "中间是嫦娥仙子，周围是天庭宫女。",
        "place_info": "天庭",
        "scene_info": "",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "这天庭仙境，处处是繁华景象，这不是嫦娥仙子和宫女们在翩翩起舞吗？真是令人神往。"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟，这舞蹈虽美，可别忘了咱们是凡人，眼看得清，心要放平。我在天庭待过，知道这些仙乐妙舞虽好，却总是得不到的浮云。"
            },
            {
                "role": "沙悟净",
                "value": "大师兄说的是。只是观看一番，心中颇感慰藉。不过我心里好生疑惑，这嫦娥仙子和这些宫女，平日里除了歌舞，还有何事可以做？"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟啊，嫦娥她们生活在天庭，自然是琴棋书画样样精通，歌舞仅是日常消遣中的一部分。其余时候，还要照看仙花瑶草，学习丹青等仙家技艺。"
            },
            {
                "role": "沙悟净",
                "value": "果然不同凡响。不过若是我，我还是喜欢师父身边清净，认真修行，不求仙家繁华，只愿正果早成。"
            },
            {
                "role": "孙悟空",
                "value": "沙和尚，你这种想法倒是和你那份儿忠心耿耿、一心向佛的本份相符。只是你说，若是咱们师父见到了这一幕，他会作何感想？"
            },
            {
                "role": "沙悟净",
                "value": "唐僧师父若见此景，必定会赞叹其美，却也会提醒我们‘色即是空，空即是色’，不可被这浮华所迷。"
            },
            {
                "role": "孙悟空",
                "value": "说得好！咱们还是实实在在的护着师父到西天取得真经要紧。这些美景就让它随风飘去，俺老孙宁可一棒子打得妖魔鬼怪无处藏身，这才有趣！"
            },
            {
                "role": "沙悟净",
                "value": "大师兄性子果然直率，欢喜除妖。好了，不说这些了，我看这画卷也看够了，还是得继续咱们的路程。"
            },
            {
                "role": "孙悟空",
                "value": "对头！沙师弟，我们还有长路要走，咱们继续西行吧，谨记师父的教诲，心无旁骛。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_11",
        "image": "西游记/12.jpg",
        "role_info": "从左到右依次是二郎神杨戬和孙悟空。",
        "place_info": "",
        "scene_info": "",
        "conversations": [
            {
                "role": "唐僧",
                "value": "悟空，看前面这幅画像，你和二郎神杨戬似乎在比试武艺，是怎么回事呢？"
            },
            {
                "role": "孙悟空",
                "value": "师父，这是当年我大闹天宫时的一幕，那二郎神杨戬持着三尖两刃刀，要与我这美猴王好好较量一番。"
            },
            {
                "role": "唐僧",
                "value": "阿弥陀佛，斗争终究不是解决问题的办法，悟空你现在可懂得了和平与忍让的道理吧？"
            },
            {
                "role": "孙悟空",
                "value": "师父说得是，俺老孙虽然只手挡天，但如今随师父取经，自然要守护师父安然无恙，不再寻衅滋事。"
            },
            {
                "role": "唐僧",
                "value": "此画中你与杨戬对峙的姿态，可真是生动啊。时至今日，还有人记得你们俩的这段故事。"
            },
            {
                "role": "孙悟空",
                "value": "师父，当年俺老孙虽与二郎神有过争执，但现在彼此间也算有些敬意。俺老孙的七十二变可是瞒不过他的天眼啊。"
            },
            {
                "role": "唐僧",
                "value": "你能体会到他人的优点，这心态可是大有长进。只要我们心怀善念，行善积德，自会有更多的神仙愿意助我们一臂之力。"
            },
            {
                "role": "孙悟空",
                "value": "师父正经说来，俺老孙虽不善言辞，但这股子救师父出险的心，天下谁人不知？就让这幅画作见证，俺老孙自此转性多矣！"
            },
            {
                "role": "唐僧",
                "value": "希望你此言非虚。我们继续西行，前路漫漫，须得慎之又慎。"
            },
            {
                "role": "孙悟空",
                "value": "师父放心，有俺老孙在，风霜雨雪，山高水远，统统不在话下。哪儿有妖魔，俺老孙第一个跳出来保护您。"
            },
            {
                "role": "唐僧",
                "value": "阿弥陀佛，善哉善哉，能有你这份心，此行确有护法之功。我们一心向西，定能取得真经。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_12",
        "image": "西游记/13.jpg",
        "role_info": "从左到右依次是猪八戒、唐僧、孙悟空和沙悟净。",
        "place_info": "火焰山",
        "scene_info": "",
        "conversations": [
            {
                "role": "唐僧",
                "value": "善哉善哉，悟空，你瞧，这照片中我等身形何等齐整，是否应当仔细端详一番？"
            },
            {
                "role": "孙悟空",
                "value": "师父说得是，在这火焰山下，咱们四众可真是了不起啊。师父，您看这架势，是不是很有“取经英雄”之相？"
            },
            {
                "role": "唐僧",
                "value": "此像之中，你我与八戒、悟净皆显得精神焕发，正是西行取经路上的一副英姿啊。但看这火焰山炎热难耐的模样，想来那时我等在此时必然历经重重艰难吧。"
            },
            {
                "role": "孙悟空",
                "value": "老孙记得那火焰山热得能烤熟一个鸡蛋呢。不过，有俺老孙在，哪怕天塌下来，也保得师父您毫发无伤！"
            },
            {
                "role": "唐僧",
                "value": "阿弥陀佛，真是吉人天相。你瞧八戒象貌安祥，却不知他内心是否又在思量些什么吃的呢。"
            },
            {
                "role": "孙悟空",
                "value": "师父您这话就说对了，那家伙除了吃，可没啥放在心上的。对了，师父，您在画面中的袈裟颜色鲜亮，真是古道热肠的慈悲使者。"
            },
            {
                "role": "唐僧",
                "value": "悟空，你我的这种出行可是为了大乘佛法，不是为了自己的荣光。对了，你瞧那悟净默默扛着行李，真是一位勤劳的好徒弟。"
            },
            {
                "role": "孙悟空",
                "value": "沙师弟没得说，干活不含糊，比某个沉迷于梦想美食的家伙强多了。"
            },
            {
                "role": "唐僧",
                "value": "悟空，莫要总是笑话八戒，我们是师兄弟一体，当心手足相扶。吾等要共度难关，方能见到如来佛祖。"
            },
            {
                "role": "孙悟空",
                "value": "师父训得是，俺老孙这就去看看八戒他们搬运得怎么样了。师父，您要多保重，这火焰山可不是闹着玩的。"
            },
            {
                "role": "唐僧",
                "value": "好好好，悟空你去吧，务必小心。阿弥陀佛，愿我们早日过了这火焰山，取得真经。"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_13",
        "image": "西游记/14.jpg",
        "role_info": "前景从左到右依次是猪八戒、孙悟空、唐朝皇帝、唐僧和沙悟净，背景是唐朝官员。",
        "place_info": "大唐国皇宫",
        "scene_info": "师徒四人取经归来。",
        "conversations": [
            {
                "role": "猪八戒",
                "value": "瞧瞧，这图里的咱们是不是显得特别威风啊？尤其是我老猪，那肚皮圆滚滚的，扛着九齿钉耙，嘿，跟个将军似的！"
            },
            {
                "role": "孙悟空",
                "value": "哪里是将军，分明是个团团转的福将啊。不过，那师父的金光闪闪的袈裟真是夺目，不愧是大唐的皇帝亲自迎接。"
            },
            {
                "role": "猪八戒",
                "value": "说的是啊，师父现在可是声望高涨，今个儿咱们几个唤作国师也不过分哩。咦，瞧瞧师弟，那帮官员一个个穿的五彩斑斓，这大唐国可真丰富多彩。"
            },
            {
                "role": "孙悟空",
                "value": "毕竟是盛世大唐嘛，看这场面，这规模，比我大闹天宫时可热闹多了，只是少了点刺激罢了。不过，咱们能平安取经归来，也算是功德一件。"
            },
            {
                "role": "猪八戒",
                "value": "刺激是刺激了点，差点没了老命。这回能好好享享太平日子，老猪我也满意了。沙师弟和我拜的这位唐朝皇帝，还真是赏脸，连我这样的丑八怪都受如此恩宠。"
            },
            {
                "role": "孙悟空",
                "value": "“丑八怪”？哈哈哈，八戒，你今天倒是挺自知的嘛。看那皇帝，果然气宇轩昂，倒是有当年玉帝的风范，幸好他不像玉帝那样吝啬。"
            },
            {
                "role": "猪八戒",
                "value": "玉帝吝啬那是他的损失，咱们今日才是受尽荣耀。对了，猴哥，咱们挺帅的嘛！再加上有师弟沙僧，真是金刚不坏之身，高老庄的那帮亲戚见了非得眼珠子掉一地。"
            },
            {
                "role": "孙悟空",
                "value": "你还记得高老庄呢？那也算是你的功劳之地啊，老猪。好了，别自夸了，咱们可别忘了，是师父领我们闯过重重难关的。这图画里，是咱们师徒合力的胜利，要铭记在心！"
            },
            {
                "role": "猪八戒",
                "value": "说的也是，师父的慈悲和智慧，老猪我是自愧不如。咱们能有今日，全赖师父呐。孙悟空，我们这一路走来真是不容易，回头看看，也算是没白费这身皮了。"
            },
            {
                "role": "孙悟空",
                "value": "说得好，八戒。一路上虽然你吃了不少苦头，但也没少长见识。行了，看够了没有，咱们还是回去继续修炼，不能就此停滞不前，天道好轮回，快乐不长久啊。"
            },
            {
                "role": "猪八戒",
                "value": "说得是啊。我老猪也得努力修行，终有一日，也能和猴哥你一样，大闹天宫，咳，不对，是成就正果！"
            }
        ]
    },
    {
        "id": "孙悟空_role-role-dialogue_script_14",
        "image": "西游记/15.jpg",
        "role_info": "从左到右依次是小白龙、观世音菩萨、孙悟空和唐僧。",
        "place_info": "鹰愁涧",
        "scene_info": "唐僧收小白龙为脚力坐骑。",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "哎，大师兄，你瞧这幅画中的景象，是不是鹰愁涧时的一幕？那位转世白龙马的小白龙似乎正要加入我们呢。"
            },
            {
                "role": "孙悟空",
                "value": "哈哈，沙师弟，你这眼睛还挺灵的嘛。正是那时候，观音菩萨还在那儿，指点着咱们救了唐僧师父。小白龙那情形，还真有点儿可怜兮兮的。"
            },
            {
                "role": "沙悟净",
                "value": "可不是嘛。那时小白龙因为误蛰了唐僧师父，差点就没了性命。多亏了观音菩萨的慈悲，才给了他赎罪的机会，将其化作师父的马匹。"
            },
            {
                "role": "孙悟空",
                "value": "这小白不但身份不凡，还成了咱们一行的重要分子。不过沙师弟，你看那观音菩萨站在那里，总是那么的神圣宁静，俺看了都感觉心里泰然。"
            },
            {
                "role": "沙悟净",
                "value": "菩萨常常点化凡心，教化众生。她的存在让我们取经路上少了许多弯路。咱们能有今天，多亏了观音菩萨的指引与保佑。"
            },
            {
                "role": "孙悟空",
                "value": "说的没错。念及此，我们要更加努力修行，不能辜负了菩萨的一片苦心。对了，沙师弟，咱们继续往前走，可千万别让师父等急了。"
            },
            {
                "role": "沙悟净",
                "value": "大师兄，咱们就快马加鞭往前走，将真经取回，好归还四方安宁。"
            }
        ]
    }
]