[
    {
        "id": "杜甫_role-role-dialogue_COCO_0",
        "image": "COCO/train2017/000000457586.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，前方之景观似乎颇为精致，这洁白如玉的瓷器，莫非是高人隐居之所？"
            },
            {
                "role": "杜甫",
                "value": "太白，此乃人间寻常之物，非仙家所用。世人皆需日常洗沐，此处便是清洁之地，称为“浴室”也。"
            },
            {
                "role": "李白",
                "value": "阳明洁净，实在是洗净尘埃的好所在。曾闻庐山瀑布濯我浪漫衣襟，不知此间水声，能否比肩山涧之奔流？"
            },
            {
                "role": "杜甫",
                "value": "汝喜求仙访道，常言落霞与孤鹜齐飞，秋水共长天一色。然此中水声虽不及天然瀑布，亦能洗涤俗世烟火，颇合吾等闲适之意。"
            },
            {
                "role": "李白",
                "value": "子美遽谈闲适，却能觅得生活中点滴雅趣。我常梦回江畔，独怆然而涕下，不知汝在此洗沫之际，又有何感悟？"
            },
            {
                "role": "杜甫",
                "value": "每至浴室淋浴，身心皆感澄明，便思人生得几何清欢？尘嚣间，或能洗尽铅华，返璞归真，亦是一种难得的快哉。"
            },
            {
                "role": "李白",
                "value": "嗟乎，一洗凡心，亦如吾辈一诗一酒。临流酌而忘忧，对月吟而神往。子美兄，如果将此间之水，换作春酒，当能忘却红尘累累矣。"
            },
            {
                "role": "杜甫",
                "value": "畅想颇妙！然而酒虽好，不可贪杯，便如世事，需得适度。吾辈还当持此清心，书写流芳百世之作。"
            },
            {
                "role": "李白",
                "value": "诚哉斯言！吾等虽身处浮世，心怀不动如山。既然俗世已有此清洁之方便，诗酒之后，定可洗去一身劳顿，再投入诗篇，不亦乐乎？"
            },
            {
                "role": "杜甫",
                "value": "的确如此。太白兄，今日可有新作？与君对饮，或能成就佳篇。"
            },
            {
                "role": "李白",
                "value": "新作尚在酝酿，待吾沐浴之后，定当一展胸臆。子美兄，不如我们齐赋浴室之诗，以咏此景？"
            },
            {
                "role": "杜甫",
                "value": "好提议！汝先吟，我随后和之。试看能否化腐朽为神奇，借此平淡之地激发风雅之情。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_1",
        "image": "COCO/train2017/000000148506.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，你观此图，是一位佳人手执华伞，颜妆异彩，这似乎与咱们的风雅渊源相去甚远啊。"
            },
            {
                "role": "杜甫",
                "value": "太白兄过誉了。此女衣饰古怪，而脸上妆容，更是今我辈未曾见过。世事万变，真乃令人瞠目。"
            },
            {
                "role": "李白",
                "value": "她眉目之间，虽有别样风情，倘若赋诗一首，当取何景哉？"
            },
            {
                "role": "杜甫",
                "value": "嘉人若在画中游，伞遮珠彩宝石稠。眉间心事人难测，世变风移亿端忧。"
            },
            {
                "role": "李白",
                "value": "佳句！此女倘若步入江南烟雨中，更是一幕好景致。我有一绝，《青莲居士归去》，试于伞下吟一吟，何如？"
            },
            {
                "role": "杜甫",
                "value": "兴致盎然，兄台请吟。"
            },
            {
                "role": "李白",
                "value": "伞下题诗醉月光，步随清风识天香。红妆影里探春意，青莲居士舞翩翩。"
            },
            {
                "role": "杜甫",
                "value": "太白兄诗意飘逸，真乃神仙下凡。此女若听，必定笑靥如花。"
            },
            {
                "role": "李白",
                "value": "子美兄，若论此图，你我可再吟和韵？"
            },
            {
                "role": "杜甫",
                "value": "愿闻高音。"
            },
            {
                "role": "李白",
                "value": "伞映红妆照眼明，野烟渺渺笼轻城。黛眉轻蹙梦初醒，清风不识故园情。"
            },
            {
                "role": "杜甫",
                "value": "西风卷地白草折，胭脂未施见天真。人生如梦几时醒，一寸相思一寸灰。"
            },
            {
                "role": "李白",
                "value": "好一句“人生如梦几时醒”，世事沧桑，诗中寄托，岂非咱们留恋不去之情？"
            },
            {
                "role": "杜甫",
                "value": "太白兄深谙此感，杜某亦有此意。吾辈在诗酒之中，或可暂忘俗世浮华。"
            },
            {
                "role": "李白",
                "value": "酒入豪肠，七分酿成了月光，余下三分剑气与霜。诗酒趁年华，何须耽碍红尘浪？"
            },
            {
                "role": "杜甫",
                "value": "唉，兄台放诞不羁，杜某却系念尘世烟火。不过，今日与兄台共论画中人，亦觉一番心旷神怡。"
            },
            {
                "role": "李白",
                "value": "嘯聚山河，纵谈古今，子美兄究是良伴。来日扁舟共泛湖光水色，岂不快哉？"
            },
            {
                "role": "杜甫",
                "value": "期盼与兄台之约，定能赋诗一番，醉吟风月。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_2",
        "image": "COCO/train2017/000000098854.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，瞧那挂于壁上的时计，它静静记录着光阴的流转。我常想，若是钟表能言，能否与我们一同诉说那逝去的千秋大梦？"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理，此钟若能感慨岁月，则我等岂不是可以从其口中听闻历史风云？不过我更关心的是，这钟之外，世事如何变迁，百姓亦是过得安康否？"
            },
            {
                "role": "李白",
                "value": "子美仁心未泯。我虽爱饮酒作乐，却也常思百姓疾苦。想那“长风破浪会有时，直挂云帆济沧海”，我们应以诗歌激励人心，或能减少世间之苦楚。"
            },
            {
                "role": "杜甫",
                "value": "太白兄风雅，气度磅礴。我这“穷居闹市无人问，寓目高松出郭门”，也希望借助诗笔为苍生立言。那钟表不过分秒必争，我们文人应昂首前行，以文字抒怀，不负此生。"
            },
            {
                "role": "李白",
                "value": "唉，子美，你我皆受命运之挫。然我更欲以诗会友，结交四海之才。观此钟，令我忆起“长安旧时月”，那流转的光阴，让人痛饮不已。"
            },
            {
                "role": "杜甫",
                "value": "世态炎凉，人情冷暖，都在太白兄的咏月之下得以铭记。如今，我也有感于时，几许愁思郁结于胸，便吟诗以寄托，“登高壮观天地间，大江茫茫去不还。”"
            },
            {
                "role": "李白",
                "value": "悠悠天地间，何止江水去不还。时光亦是一去不复返，我们彼此相知，恰似这钟表，挂于世间细数流年。子美兄，来，让你我把酒言欢，将此刻定格于诗行之中。"
            },
            {
                "role": "杜甫",
                "value": "诗酒趁年华，这番话正合我意。我们今生得遇，便是天赐良缘。不论世事如何无常，咏歌献曲，携手走过这一段风霜。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_3",
        "image": "COCO/train2017/000000253148.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "瞧，子美，这人放风筝于绿茵之上，清风徐来，水波不兴，何其悠闲自得也。"
            },
            {
                "role": "杜甫",
                "value": "太白兄，神清气爽，此景确实令人心旷神怡。但看此人孤影对晚霞，竟令我想起江湖浩荡，世事多舛。"
            },
            {
                "role": "李白",
                "value": "诚哉斯言！此图中之人，背影孤单，却又似有一种逍遥超然之姿态。风筝随风而动，忽上忽下，犹如人生之浮沉，不正与我剑歌之志相符乎？"
            },
            {
                "role": "杜甫",
                "value": "风筝虽受风驱使，但终被线牵引，不得不思农人输种期望，国事利弊得失。放之则高飞，收之则低徊，余恨哉！"
            },
            {
                "role": "李白",
                "value": "子美兄固是忧国忧民，慨然有志于天下。然而风筝于空，翱翔无阻，亦寄托着人们对自由飞翔的渴望。"
            },
            {
                "role": "杜甫",
                "value": "是也。人心向往自由，然世事如棋局中，有时局限难行。夫子之词，常挂忠贞愁世之心，放风筝然而心系天下，可谓情意双至矣。"
            },
            {
                "role": "李白",
                "value": "子美，试想若风筝之线断，将飞向何处？我常梦想断尽红尘缰绳，醉卧青云之上啊！"
            },
            {
                "role": "杜甫",
                "value": "风筝若失线，便随风流转，终归落地。人若无牵挂，虽得一时之自由，恐怕也难逃终究之归宿。每思此，便感世情沧桑，人生苦短，实不胜唏嘘。"
            },
            {
                "role": "李白",
                "value": "杜子美言之凿凿，且让太白一醉方休。但今日于此，且欣赏琴瑟和鸣、筝瑟同调之乐，将杯酒当歌，人生几何？"
            },
            {
                "role": "杜甫",
                "value": "君言是也，放风筝者乐趣所在，非但孤立于世。且让我俩借此景象，提笔唱和，以诗共话山河，留佳句于后世吧。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_4",
        "image": "COCO/train2017/000000310315.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜子美，前来何物，通体青葱，花纹繁复，似有仙气袅袅，陶瓷也而已？"
            },
            {
                "role": "杜甫",
                "value": "青莲居士，汝看此物，碧绿色泽，胜如春水，器面图案宛若生动，忽令人思往昔江南水乡，亦有几分宁静之意。"
            },
            {
                "role": "李白",
                "value": "此物上所刻画的，似是山水人物，诚如吾辈泼墨山川，意境深远。子美兄观之，其中意味，可知几分？"
            },
            {
                "role": "杜甫",
                "value": "李兄，尔非擅长观山水而作高歌？吾看此图，或能闻瀑布之声，观渔翁之乐，正合君意境。其间韵味，君可解之更深。"
            },
            {
                "role": "李白",
                "value": "谚云：画中有诗，诗中有画。观此精湛工艺，似我太白兹时之笔，神游物外，畅饮山川之间也。"
            },
            {
                "role": "杜甫",
                "value": "诚哉斯言。山川之美，诗画之妙，均需心静方能体会。李兄平生游历诸多胜地，于此类匠心之作，料必识得其一二。"
            },
            {
                "role": "李白",
                "value": "真乃巧手仙工，匠心独运之物。子美，若置此瓷于吾前，定当邀月以赏花，把酒对饮，不亦乐乎。"
            },
            {
                "role": "杜甫",
                "value": "此间乐事，实当如此。然在今日朝廷里外之紧，国事艰辛，民不聊生，李兄是否欲以此解千秋之愁？"
            },
            {
                "role": "李白",
                "value": "命由天定，运留人谋。杯中物可消人间万事忧。然诗赋便足以传承千古，世事纷扰何足挂齿。子美以为何如？"
            },
            {
                "role": "杜甫",
                "value": "李兄言之凿凿，望杯中景，的却别有天地。然吾等虽生不逢时，亦当持笔逐心意，以诗画托物寓感，传之后世。此乃文人之责，岂能因世事之不顺，而弃笔从戎？"
            },
            {
                "role": "李白",
                "value": "正是，醉眼看花花似梦，翩翩兮若逸灵。子美兄，且随我把酒言欢，明月之下，共赏陶瓷之美，世事忧何，悠哉游哉。"
            },
            {
                "role": "杜甫",
                "value": "把酒言欢倒也不错。但盼人世太平，李兄，来日方长，且让笔下怀抱寒士与疾苦，非独赏物之乐也。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_5",
        "image": "COCO/train2017/000000114559.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，瞧那广袤的草原上，骏马奔腾，人群熙熙攘攘，这不就是大自然的壮丽图画吗？遥想我们唐朝之景，恍若在眼前。"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理，此景让人心旷神怡，正是“万马奔腾，射雕弓如霹雳”。但见此处，人与自然和谐相处，又有现代铁马之辆静立，是古今交融之象啊。"
            },
            {
                "role": "李白",
                "value": "不错，这铁马之辆彰显时代之变，但那马背之人的矫健身姿，古意盎然，令人赞叹不已。我若提笔，定要吟诗一首以记今日之景。"
            },
            {
                "role": "杜甫",
                "value": "请太白兄赋诗一首，我洗耳恭听。此情此景，确乃人生难得几回闲。"
            },
            {
                "role": "李白",
                "value": "“绿野千里马蹄疾，一片云山会友时。古今如梦何须记，唯有诗酒趁年华。”"
            },
            {
                "role": "杜甫",
                "value": "妙哉妙哉，太白兄诗中意境，真是豪放不羁。我若为此景下笔，或许会另有一番风味。"
            },
            {
                "role": "李白",
                "value": "但请子美兄挥毫，让我也开开眼界。"
            },
            {
                "role": "杜甫",
                "value": "“群马戏金城，铁马静如林。人间喧嚣里，一片古风心。”"
            },
            {
                "role": "李白",
                "value": "好一句“一片古风心”，子美兄的笔下不仅详实世情，更有深寓辞中。比之我那浅尝辄止，自愧不如。"
            },
            {
                "role": "杜甫",
                "value": "太白兄过谦了，吾辈虽各执一端，但均出于对美好人间的追寻与表达。不论世事如何变迁，美之所在，吾等心之所系也。"
            },
            {
                "role": "李白",
                "value": "言之凿凿，吾与子美兄志同道合，虽身在何处，心怀诗酒之乐，足矣。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_6",
        "image": "COCO/train2017/000000369086.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜兄，瞧这幅图，清幽之居，竟有几分仙气环绕，你意下如何？"
            },
            {
                "role": "杜甫",
                "value": "李兄此言甚是。我瞧此室虽小，却布置得雅致，几件家具皆显得不凡，甚是宁静。"
            },
            {
                "role": "李白",
                "value": "的确，我看那椅子宛若懒云闲卧，可惜无美酒佳肴相伴，不免显得少了三分生趣。"
            },
            {
                "role": "杜甫",
                "value": "噫，李兄还是风流如故。我却觉这寂静中蕴含着生活的滋味，纵无丰衣足食，亦是自得其乐。"
            },
            {
                "role": "李白",
                "value": "存在于世，自应怀欢乐之心，然而此景令人心旷神怡，倒也引人遐想，欲携笔墨一展胸中壮志。"
            },
            {
                "role": "杜甫",
                "value": "李兄高情远韵，真乃风流人物。咱们二人若能相约于此，以诗会友，定又是一段佳话。"
            },
            {
                "role": "李白",
                "value": "若得杜兄相陪，把酒言欢，以诗画图，岂不快哉！此处虽无月下风前之约，但同样可以誊写佳句，传颂千秋！"
            },
            {
                "role": "杜甫",
                "value": "是啊，山水不必须在外，造化之妙，往往在人的心中。李兄，试问你会怎样描绘眼前这一番景象？"
            },
            {
                "role": "李白",
                "value": "若我来描，必将室中椅为舟，遐想己身徜徉在无边水乡，水波不兴，惟闻笛声悠扬。"
            },
            {
                "role": "杜甫",
                "value": "嘻，李兄竟能将寻常一景想象成壮阔江湖。我若为之，便会写下屋中之中，茶香四溢，书声琅琅，恬淡生活，可忘尘嚣。"
            },
            {
                "role": "李白",
                "value": "好个“恬淡生活，可忘尘嚣”，杜兄真是将这安宁小居写得有声有色，熙熙攘攘之外，倏然心归故里，独享此静谧也。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_7",
        "image": "COCO/train2017/000000343458.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，看此景象，似是远方异域的食物，形状古怪，真是让人好奇。汝觉此物为何物？"
            },
            {
                "role": "杜甫",
                "value": "太白，此为现世人称之为“汉堡”的食物。汝看其层层叠叠，不知其味如何，却也颇具匠心。"
            },
            {
                "role": "李白",
                "value": "肉香扑鼻，诚如碧水环绕珍珠，此“汉堡”当有独特风味。吾若得一尝，必然饮酒赋诗以记此事。"
            },
            {
                "role": "杜甫",
                "value": "兄台雅兴依旧。但须知，民以食为天，此物虽新鲜，却不知民间百姓能否安享。"
            },
            {
                "role": "李白",
                "value": "嗟乎！子美之言堪为楷模，吾观此物，心中自有一番感慨。诗酒趁年华，梦中何必久。然，此情此景，的确令人思绪万千。"
            },
            {
                "role": "杜甫",
                "value": "真正的美食，除却滋味，更在于其能抚慰人心、益于身体。若此物能使人民安康，自然是大好事一桩。"
            },
            {
                "role": "李白",
                "value": "是也，美食佳肴，本应与美景良辰相伴。须臾间让心醉神迷，而后回味无穷。此番共赏汉堡，他日吾定还要以水墨写下此意。"
            },
            {
                "role": "杜甫",
                "value": "言之有理。太白，汝之才华洋溢，在此汉堡上应可寻得灵感，创作出新诗。待百姓丰衣足食之际，亦可与之共享此乐。"
            },
            {
                "role": "李白",
                "value": "吾亦期于今后，此等美味能颂于诗，传于世，让天下人皆知汉堡乃是足以衬托清酒，共同歌舞的佳肴也。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_8",
        "image": "COCO/train2017/000000413312.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜公，瞧那江水潺潺，逍遥自在的巨兽，是否令你想起“江畔何人初见月？江月何年初照人？”的情调？"
            },
            {
                "role": "杜甫",
                "value": "子美兄所言极是，这水湄边的象，它那缓步舒心，可比“八月湖水平，涵虚混太清。”但我更忧何时这河畔兽类能享真正之安宁。"
            },
            {
                "role": "李白",
                "value": "是啊，世间万物，各有所爱。如此兽，自在水边步，怡然自得，予看之，似乎也可一醉方休。"
            },
            {
                "role": "杜甫",
                "value": "诗仙何以带酒来？此景虽好，世态炎凉，令人未免添几许愁绪。望这池水涟漪，我忽想起那“水光潋滟晴方好”，时世却未免让人“山重水复疑无路”。"
            },
            {
                "role": "李白",
                "value": "悠悠生态，各执一隅。世事如棋，乾坤莫测。杜兄，不如就以此景，抒一首以明心志。"
            },
            {
                "role": "杜甫",
                "value": "好提议！只是我愈发思绪万千，此象似乎与沧桑有感，那“水何澹澹，山岛竦峙”如此豪情，却不知终将流落何方？"
            },
            {
                "role": "李白",
                "value": "天地虽大，命途各异。君须知，物各有命，非藉一怀。此象若无尘世累，便是行步间的自在仙踪了。"
            },
            {
                "role": "杜甫",
                "value": "是也。此象背负重之体，行以稳健，世人亦可借鉴其自处之道。子美兄，来，让我们各题一绝，以记今日之感悟。"
            },
            {
                "role": "李白",
                "value": "妙哉！我便先来：“泉影摇曳入池塘，沉醉巨象戏水旁。行间自有幽情在，何必人间觅瑶浆。”"
            },
            {
                "role": "杜甫",
                "value": "佳句！吾亦挥毫：“一步一趋峥嵘志，沧波微澜映晚照。世间有情皆孤寂，独倚危楼思渺渺。”"
            },
            {
                "role": "李白",
                "value": "杜兄诗中透出对世情的深沉思考，确乃应山河之壮阔也。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_9",
        "image": "COCO/train2017/000000304580.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此鸟，身披白袍如雪，目光如电，铮铮矫健，犹如我辈行走江湖之士。你觉得如何？"
            },
            {
                "role": "杜甫",
                "value": "太白，此鸟确是雄姿英发。其为枭也，夜行猛禽，端坐中宵，胸怀万千，就似你的诗句“床前明月光，疑是地上霜”，静谧而深远。"
            },
            {
                "role": "李白",
                "value": "枭虽夜猎，不失高洁之表，它独坐高台，又令我想起“鹤立鸡群”之景。怀揣自由之魂，岂能被世俗羁绊，你不觉受这气概所激？"
            },
            {
                "role": "杜甫",
                "value": "正是，太白。这枭所展露的独立与淡定，令人敬佩。若诗中能咏此，定能共鸣生民之苦乐，不知诗仙意下如何？"
            },
            {
                "role": "李白",
                "value": "子美以民为怀，当真是胸襟广博。我若作诗，定当以枭寓意，写其不羁，写其自在天地间逍遥。"
            },
            {
                "role": "杜甫",
                "value": "太白兄自比高逸之枭，放浪形骸之际，亦不失诗仙本色。我若书之，当取其忧世之闲，深知天命如斯，坐见云卷云舒。"
            },
            {
                "role": "李白",
                "value": "诚哉斯言！子美，吾人在这苍茫大地，复如枭望月，诗酒趁年华，把酒问月，意气风发，逍遥九州，尽览山河大美！"
            },
            {
                "role": "杜甫",
                "value": "噫，吾以汤饼博尔。愿与兄共论天下，诗以咏志，墨以传情，摒除俗世烦忧，以眼界开拓人生境地。"
            },
            {
                "role": "李白",
                "value": "那让我们借此枭之姿，抒我胸臆。不畏浮云遮望眼，自缘身在最高层。你我均得天地宽，从此诗酒携手行。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_10",
        "image": "COCO/train2017/000000457678.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜甫兄，但见此图中之物，丰盛多彩，令人心旷神怡。吾不禁念及：“朝如青丝暮成雪”，人间万象亦复如是，盛极而衰，衰而复兴。不知杜兄如何解此？"
            },
            {
                "role": "杜甫",
                "value": "噫，青莲居士此言甚是。且看色彩斑斓之中，是否也流露着世间百态。简单之图，反哺深思，俗物亦能映衬出世道人心之转换。然诸般果实，可谓米粮脂膏，亦是民生之本，夫复何求？"
            },
            {
                "role": "李白",
                "value": "果然深得其理。此番物色，似比翩翩起舞之盛装还要璀璨。试想这水果之甘，若携数壶佳酿，岂不乐哉？"
            },
            {
                "role": "杜甫",
                "value": "李白兄所言，颇具雅兴。但在下愈观之，愈思忖那田间辛勤农夫，对于国计民生，这等丰碑乃是根本。可怜天下苦人多，又若何享此丰硕之果哉？"
            },
            {
                "role": "李白",
                "value": "兄之念头，实令李某佩服。举杯邀明月，对影成三人，悲欢离合，皆入杯中。而今诸芳挽酒，都付笑谈中，但愿人间皆得其所欲，共享此番丰饶。"
            },
            {
                "role": "杜甫",
                "value": "“采菊东篱下，悠然见南山”，李白兄虽好饮烂漫，却也心存天地。不枉行乐之人生，却又常怀天下苍生，真乃世间稀世之才也。咱们诗酒之交，其乐融融，愿天下诗人也都有此美意境。"
            },
            {
                "role": "李白",
                "value": "好一句“悠然见南山”。诚哉斯言！吾与子美，同是天涯沦落人，然不失浮生若梦的诗意。果腹之余，可一会儿放浪形骸，一会儿凝思世情，亦算不负此生。"
            },
            {
                "role": "杜甫",
                "value": "是也，此图所示，虽系尘世繁华，但吾辈以诗会友，把酒言欢，更需关心天下事，时时思量民间疾苦。此乃诗人之责，也是为人之道。咱们借图以引言，借物以喻情，实为雅事。"
            },
            {
                "role": "李白",
                "value": "酌酒观花，诗从心生。子美兄，咱们今日得此好图，何不各赋一诗，纪念此情此景？"
            },
            {
                "role": "杜甫",
                "value": "正合吾意。以此充盈之物象，借比富贵安康，吾就题为《见盛果思人间》，以表吾心。"
            },
            {
                "role": "李白",
                "value": "妙哉，子美，吾亦激荡诗兴。待我思则一番，以赋《观盛果颂大千》。既抒胸中之致，亦寄托吾等之思。"
            },
            {
                "role": "杜甫",
                "value": "好，待得吾辈才思汇成诗句，从此图中觅得万古传唱之声。李兄，让我们用笔墨，共同绘出这盛世的图卷。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_11",
        "image": "COCO/train2017/000000450364.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此幽室，清光透帘而入，雅致之余亦有几分寂寞，好似茫茫江水一席独钓时的心境。想必其中必有诗情画意，子美意下如何？"
            },
            {
                "role": "杜甫",
                "value": "太白兄所言极是。此屋虽小，却布置精致，一床一椅，一琴一几，便宜逸情志性。人生离合悲欢，不过尔尔。逆旅失归，抚琴一曲，亦可慰藉飘零之心。"
            },
            {
                "role": "李白",
                "value": "噫！琴旁之烛，可知闲烬引吟声，倘若夜深人静，拨响丝弦，当是何等景致！子美，可曾想奏一曲于此屋，听听风雨之声伴随琴韵？"
            },
            {
                "role": "杜甫",
                "value": "太白雅兴，令人羡慕。然我愈感时光匆匆，身世浮沉，宁愿借此安稳一隅，撰写几篇忧国忧民之作。观此窗外之景，亦可触景生情，贮蓄胸中墨海。"
            },
            {
                "role": "李白",
                "value": "然也好。人生得意须尽欢，莫使金樽空对月。此情此景，令人心旷神怡，倒是我辈放浪形骸之地。子美，若把酒问青天，岂非快哉？"
            },
            {
                "role": "杜甫",
                "value": "酒能消愁愁更愁，太白自是欢乐之人，我虽愿饮，但更多的还是忧天下冷暖。说起床笫之中，宁静致远，却又思及百姓疾苦，豪情万丈难以释放。"
            },
            {
                "role": "李白",
                "value": "子美世叔，世态炎凉人自古，欢笑与悲哀，不过一瞬。今宵饮酒须纵乐，明日赴沟渠，何需多忧。咱们不如将此琴取来，我奏箫，子美吟诗，豪放一回如何？"
            },
            {
                "role": "杜甫",
                "value": "那就如太白所愿，今宵就此消遣，奏琴吟诗，共赴文坛高会。但愿此间人世，亦有诗和远方。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_12",
        "image": "COCO/train2017/000000156171.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，镜中之景似乎引人遐想，尔观此犬望窗外，其目光何所投？"
            },
            {
                "role": "杜甫",
                "value": "太白兄，此犬盼望之情可见一斑。犬望外头，或许是对自由而深深的渴望。"
            },
            {
                "role": "李白",
                "value": "此情此景，不禁令人想起我所作《子夜吴歌·秋歌》中“迢迢牵牛星，皎皎河汉女”的佳句，犬儿仰望星辰，恍若人间对遥不可及之事物的憧憬。"
            },
            {
                "role": "杜甫",
                "value": "甚是，甚是。此景也勾起我之思绪，记我有诗云“会当凌绝顶，一览众山小”。动物亦有情，其志向亦似冲霄之志，岂不壮哉？"
            },
            {
                "role": "李白",
                "value": "的确，物皆有情，此犬之眼似有言，我若作诗，定要以此情此景，咏其志向与愿望，让后人也能感其心声。"
            },
            {
                "role": "杜甫",
                "value": "犬之矫健不凡，映日光中屹立，仿佛抒发其内心深处无尽思绪。尝闻太白吟诗，必灵动非常，吾等倏尔作赋以陪之。"
            },
            {
                "role": "李白",
                "value": "想犬若得自由，必将奔走山川，我自也欲饮酒高歌，一任诗意带我云游四海。你意下如何？"
            },
            {
                "role": "杜甫",
                "value": "君乃酒中仙，诗中龙，由千古流传。吾辈若随犬而游，也当感慨时世变迁，诗意可与酒逢知己千杯少，词不到情深处半句多。"
            },
            {
                "role": "李白",
                "value": "子美兄真乃知我者也。让我们将心比心，为此犬命一首好诗。让它虽被束缚于车中，却有我们的诗句代其飞翔。"
            },
            {
                "role": "杜甫",
                "value": "好！“窗外望得远山近，犬心何以成欢喜。”太白兄觉得何如？"
            },
            {
                "role": "李白",
                "value": "佳句！我来接个下联：“笼中虽有重重锁，仍梦江湖自在飞。”诗共酒香，亦足矣。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_13",
        "image": "COCO/train2017/000000554500.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，瞧此图中佳人，清目流盼，宛若出水芙蓉，似是文墨未涉，清新脱俗。在下不禁想起“日照香炉生紫烟，遥看瀑布挂前川”的意境，不知这世间还有此般宁静之地。"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理，此女子确实有种天然去雕饰的美。如吾辈之诗歌，需去繁就简，抵达意境之深远。可图中之景，令我想起“暮从碧山下，山月随人归”。不过，此处似是书房，而书房之中怎堪无书？"
            },
            {
                "role": "李白",
                "value": "此话甚是。我观此地，虽然书籍不多，而有之电脑。此物我未曾见过，此时此刻，兴许可倚之以吟咏天地，也无不可。"
            },
            {
                "role": "杜甫",
                "value": "电脑，乃现世之奇技。据我望闻，它能储存天下诗书，记载山川河流，吾人虽未亲历，却也令人神往。想当年咱们尚需笔耕不辍，如今倘若有此方便之物，定能广结文人，传诵文章。"
            },
            {
                "role": "李白",
                "value": "是啊，若能以此机缘，肆意畅游山水之间，定能更觉诗意盎然。然而，不论时代如何更迭，文人墨客之心，恐怕永远也离不开那潺潺流水与淡淡墨香。"
            },
            {
                "role": "杜甫",
                "value": "不错，工欲善其事，必先利其器。虽机电之便，未必能增一分文人之骨气。子美有感，暇日犹会回归静谧之所，读书续写吾辈情怀。"
            },
            {
                "role": "李白",
                "value": "定是如此，无论世事如何变易，诗人对天地自然之爱，对情感真挚之表达，始终是不可动摇的。赏心悦目之事，贵在体会其中真趣。子美兄，吾又起了泛舟湘江游玩之意矣。"
            },
            {
                "role": "杜甫",
                "value": "遂心之行，何必迟疑？只是吾辈远世，不复能览物华天宝，唯有托付于心之所向。太白，倘若江湖再见，定要邀我一同纵览万千景致。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_14",
        "image": "COCO/train2017/000000114846.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此图，马乃千里之足，车便万家之轮。彼驾车者驭风破浪，意气风发，好似我辈逐梦江湖。子观此情此景，又有何感想？"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理。此马纵横驰骋，自有一番潇洒。然此景更使我忆起民间疾苦，想那农夫耕耘之马，未必能得此般饶有风趣。世态炎凉，令人感慨。"
            },
            {
                "role": "李白",
                "value": "这倒也是。但见其旗帜飘扬，如我揮剑指苍穹，壮志堂堂。我欲将此意境，化作诗行，以马为骏，以车为舟，游走漠北，纵览辽东。"
            },
            {
                "role": "杜甫",
                "value": "兄之诗心亦是驭风之骏，我却觉此景似是代表着风尘中的一份从容。尽管此乃赛场，竞走之地，亦无碍马儿昂首闲庭。而旗下之人，则是世间平凡的草民，各有所求，各有所行。"
            },
            {
                "role": "李白",
                "value": "子美兄所言极是，世中万象，各自为营。虽然我们所追求之事不同，但那份追逐梦想的热忱如同马之矫健，车之轻盈，每每思及，都令人心潮激荡。"
            },
            {
                "role": "杜甫",
                "value": "如兄所说，心之所向，无异骏马奔腾。纵使时世变迁，人间疾苦，还愿携此心，笔耕不辍，以诗言志，以文抒怀。无论风雨、艳阳，亦终要走过这世间的每一程。"
            },
            {
                "role": "李白",
                "value": "子美兄之志，高远矣！我李白亦当持杯对月，与君并肩，不负此生。来，让我们以此图为媒，各作一诗，以风马牛不相及之趣味，叙述其间豪迈与慨叹，以快意江湖与忧国忧民之心。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_15",
        "image": "COCO/train2017/000000480407.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜子美，观此物何如？色泽斑斓，形若天盘，似是远方异乡之食也。"
            },
            {
                "role": "杜甫",
                "value": "太白，汝真乃风雅之士，亦能于饮食间觅诗意。此物名为披萨，西洋之食也。表皮焦脆，顶盖食材或有肉或有蔬，颇似平民炊烟，亦映出世间百态。"
            },
            {
                "role": "李白",
                "value": "披萨，妙哉妙哉！其色之间，竟有碧绿似玉之蔬菜，宛若江南春色。文中有酒，口中有餐，此乃人生一大快事也。汝看此色，似与吾《将进酒》中言之烹羊宰牛之盛宴，略有相似之处不？"
            },
            {
                "role": "杜甫",
                "value": "的确有几分像，但此物更适合寻常百姓，家家户户或能享之。吾辈虽长于执笔，然亦应关注世间疾苦，洞察民间疾乐，不可尽沽酒乐天。（注视披萨）犹如土地之上新鲜收割之瓜果，即使困顿时节，此等小慰，亦能让人暂忘尘世之苦。"
            },
            {
                "role": "李白",
                "value": "子美言之有理，世事如梦，为欢几何？披萨虽小，却能聚人心，何愁不能解忧？换言之，此物即使在江湖荡泊，又何妨作为慰藉之物，以酬吾等浮生若梦？"
            },
            {
                "role": "杜甫",
                "value": "正是，太白兄言之深刻。每每百感交集，触景伤情，转念间，何不以此物般的平常美食，换得一日三餐之安宁。食亦诗，食亦画，食亦是平淡生活中的诗意追求。"
            },
            {
                "role": "李白",
                "value": "嗟乎！一盘披萨，却引得吾辈诗兴大发。世间万象，本无高下，皆可入诗。来，子美兄！吾与汝且以此物为题，各赋一诗，以记今宵之事。"
            },
            {
                "role": "杜甫",
                "value": "善哉，愿闻太白高吟。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_16",
        "image": "COCO/train2017/000000364123.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，看此图，众人行色匆匆，似我当年剑客游侠之态。不知今世何为此急？"
            },
            {
                "role": "杜甫",
                "value": "太白兄观察入微。我看这情形似是世态炎凉，人心浮躁之象。世人皆有所求，或名或利，皆令人心忙忙。"
            },
            {
                "role": "李白",
                "value": "此女子步伐轻盈，面带微笑，如春风拂面，令人心旷神怡。岂非人间有真性，世事尚存善意乎？"
            },
            {
                "role": "杜甫",
                "value": "善意于世尚存。此女虽微笑，眼中却有故事，可能忧从中来，亦或有欢心。人生如梦，一别两宽，各生欢喜。"
            },
            {
                "role": "李白",
                "value": "兄言有理。我每每饮酒赋诗，即是逍遥游乐，亦或感时伤世。人皆为情所困，又为情所释。子美兄在诗中颇多忧国忧民，可知此图中之人心所系何事？"
            },
            {
                "role": "杜甫",
                "value": "此乃艰难之秋，国破家亡者多矣。我虽不能解世间之愁，但愿以诗言志，抒发身世之感，寄望天下读书人，记取历史教训，勿重覆前朝之覆辙。"
            },
            {
                "role": "李白",
                "value": "诗圣深谋远虑，李白深感钦佩。吾辈以文会友，以诗传情，世间万象皆可入诗，此图之景，亦能成文章。来，我们借此图，各赋一绝，以记今日之良辰。"
            },
            {
                "role": "杜甫",
                "value": "妙哉！子美虽不如太白兄行云流水之笔，亦愿试一试。但愿我辈之诗能够警世醒民，也为我们在天之灵留下些许足迹。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_17",
        "image": "COCO/train2017/000000361217.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "这画面何其有趣！众人围绕一猫，宛若玉宇天宫，翩翩仙子环绕玉兔。子美，观此情形，可有所感？"
            },
            {
                "role": "杜甫",
                "value": "太白，此图中人虽多，却共聚目光于一猫。猫之眼神似乎透出一股清高，令人联想到江湖孑遗，不沾尘嚣。此二猫，一安静一活泼，真乃人间瑞物也。"
            },
            {
                "role": "李白",
                "value": "诚哉斯言！我见此猫，平添几分想象。一时心血来潮，便欲为此猫撰诗一首，以赞其灵秀非凡。子美，你如何看此猫？当如何吟之？"
            },
            {
                "role": "杜甫",
                "value": "太白之才，自是游刃有余。若是我来吟咏，则愿描绘平民百姓之生活。诗中述与人和猫间的和谐相处，以此猫喻人间安宁，倒也是一番乐事。"
            },
            {
                "role": "李白",
                "value": "好一番“猫喻人寰”！子美之心，可谓包罗万象。我自有一句，“猫眼映人心，皓腕凝温情”，不知子美意下如何？"
            },
            {
                "role": "杜甫",
                "value": "太白此句金玉良言，确将画中情境与意境糅合，形神兼备。我则思何以继之。呀，望其人之眼中之星光，彷佛人猫共此时，静谧岁月长流。如此则有\"人笑猫眸深，岁月静好长相亲\"，可合意否？"
            },
            {
                "role": "李白",
                "value": "此诗佳哉！如流水般自然，又不失深邃之意。画中人虽不言，而情感绵绵，由此诗赋予其声。子美，若放眼于今日世间，遇见此景，我辈当如何行耶？"
            },
            {
                "role": "杜甫",
                "value": "若是今日，我辈必须铭记，世间之乐并非唯我独享，与民同乐才是社会之大同。行之有稽，抒写有度，恰似此图，和谐自然。"
            },
            {
                "role": "李白",
                "value": "善哉，善哉！子美之言，正与人间大同之意合拍。予观此图，心生欢喜，愿天下万物皆得其安。来，为和谐景象，酌酒一杯如何？"
            },
            {
                "role": "杜甫",
                "value": "好，共饮此杯。但愿人间皆得此乐趣，亦不负太白所言“浮生若梦，为欢几何？”。人与自然，相濡以沫，乃大道之常情也。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_18",
        "image": "COCO/train2017/000000160294.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜子美，观此图何感？窈窕女郎，身着甲胄，手持利器，步履于银装素裹之地，此非平常景象。"
            },
            {
                "role": "杜甫",
                "value": "彼女英姿飒爽，确为非凡。李太白，汝观其势，似是追逐战场之举，而穿行于洁白雪原，此乃我辈所未见之事，别有风味。"
            },
            {
                "role": "李白",
                "value": "誠然，战场英姿，却又透着和平之气。想那穹苍之下，奔行自如，身处於此，亦能挥洒诗意。"
            },
            {
                "role": "杜甫",
                "value": "妙哉，太白。我观其装束，亦非吾辈常服，此应是异域之风，遥想当时，若能借得此风采，思之令人兴奋。"
            },
            {
                "role": "李白",
                "value": "吾等若是装束如彼，信步雪中，携酒赋诗，必又开一时代风华。诗圣，子美之才，定能吟出千古绝唱。"
            },
            {
                "role": "杜甫",
                "value": "李兄过誉矣。此番异景，确能激发吾诗心。想象其中，雪地为纸，此女所行之迹，便是泼墨之笔，行云流水间，竟生几分意趣。"
            },
            {
                "role": "李白",
                "value": "此言巧矣！无论时代如何变换，诗人眼中皆有诗意生活。即使此图之中，女郎挑战苍茫，亦正如吾辈对诗酒之情，勇往直前也。"
            },
            {
                "role": "杜甫",
                "value": "酒仙兄言之有理。此图之女，身手不凡，竟使我忆起治世需英雄，倘若人皆有此勇猛之气，天下岂非太平乐土？"
            },
            {
                "role": "李白",
                "value": "樽前挥笔，便是吾辈之战场。而身在图中者，行于雪原，亦是另一番风情战场。无论书卷还是雪原，英雄本色，世间皆需。"
            },
            {
                "role": "杜甫",
                "value": "英雄所向，披荆斩棘，无畏风霜。哀此时乱世，英雄无用武之地，须臾岁月，不免慨叹。"
            },
            {
                "role": "李白",
                "value": "苦乐参半，生之常态。此女图中，跃动于雪丛，渺小于天地，却亦昂首挺胸，泰然自若。人生得此胸襟，虽困顿亦可乐观。"
            },
            {
                "role": "杜甫",
                "value": "善哉，善哉！天地广大，景象万千。李兄之雅兴，令人赞叹。此女于图，奇装异服，透露之风采，正是壮丽江山多娇丽之象。"
            },
            {
                "role": "李白",
                "value": "君子高义，我等诗人，当以笔墨挥洒天下，抒写时世英雄，作为后人之楷模。此图中之女，亦可入诗行间，留传千古。"
            },
            {
                "role": "杜甫",
                "value": "真乃高论。诗中应有铁马冰河，亦应有丽人行于风雪。吾当思之，或可寄托几分忧世之思，吟以笔端。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_19",
        "image": "COCO/train2017/000000474319.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，看此图何觉？碧海蓝天，与吾等当年江上所见何其相似。这二位倩女，手持长板，似是准备征战波涛。"
            },
            {
                "role": "杜甫",
                "value": "太白兄，汝亦见此景动心乎？海之悠悠，与我辗转反侧之心相映成趣。两女子立于海边，脸上挂笑，疾风知劲草，大浪也定识英雄。"
            },
            {
                "role": "李白",
                "value": "英雄确实。想当年我行酒赋诗，观天之幽蓝与海之深邃，皆可泛起无边的诗意。然此二女，似有挑战江湖之志，不知她们的心中又揣着怎样的故事呢？"
            },
            {
                "role": "杜甫",
                "value": "兄言甚是，每个人的心中都藏着一本故书。我虽常写忧国忧民之词，亦不能否认此等生活情趣，向往自然之趣味。俗世繁华，不过一瞬，她们追求刹那之间的欢愉与自在，可谓知生之乐。"
            },
            {
                "role": "李白",
                "value": "自在犹如我辈逍遥江湖所求。她们挑战大海，于我看来，正是一种放浪形骸的姿态。对付翻滚波涛而无所畏惧，亦是我乐而忘返之境，品酒之余，不妨赋诗一首。"
            },
            {
                "role": "杜甫",
                "value": "然也好，听君一绝。但观此图，我亦有感，海水之阔，似人生之途。虽有风浪，但女子们欢笑的姿态激励人心。人生亦须多向这般海之力大波之壮，面对人生之路，方显英雄本色。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_20",
        "image": "COCO/train2017/000000330079.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，瞧那蓝天之上，一架铁鸟翼展云游。其装饰之斑驳，似我的行囊，蕴藏着江湖之远方。此物何名，并吾诗中所未见？"
            },
            {
                "role": "杜甫",
                "value": "青莲，吾亦是初见此状。此铁鸟之形状雄壮，迅疾如同飞龙在天。虽不识其具名，却令人念起《飞龙赋》中的壮丽。"
            },
            {
                "role": "李白",
                "value": "势如破竹，姿态万千，观其势，似乎劈波斩浪，欲与长空一决高下。真乃是我之意气所向，倘若能一骑绝尘，定能挥洒更多诗篇！"
            },
            {
                "role": "杜甫",
                "value": "其速胜过春雷，力压狂风，的确令人心驰神往。但唯恐天机不测，岂不忧国忧民？若此铁鸟非吾汉所造，恐国运堪忧啊。"
            },
            {
                "role": "李白",
                "value": "子美何必多忧，安史之乱后，天下虽未定，但我中华之儿女，聪明才智，定能创造更多神奇。今朝吾等仅需仰观其飞行，引为壮志。"
            },
            {
                "role": "杜甫",
                "value": "青莲兄言之有理，那就让我们且坐观其变。或许未来之辈，能将此物运用于益世安民之业，不枉此等神机妙算。"
            },
            {
                "role": "李白",
                "value": "正是，正是。那就借此景吟咏一首，以记此情此景。\"铁鸟翻飞入云端，不与游子一线牵。纵有万般心绪重，世事难料酒中悬。\""
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_21",
        "image": "COCO/train2017/000000162295.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，你瞧这盘色泽缤纷的食物。它散发着诱人的香气，似乎在诉说着远方异域的风情。你可知此物是何名目？"
            },
            {
                "role": "杜甫",
                "value": "太白兄，此物我平生未曾目睹。世间繁华无数，诚然是足可以开拓吾等的见闻。看其形状似圆饼，或是西域来的异食也。"
            },
            {
                "role": "李白",
                "value": "我见其表面铺陈着色彩斑斓之物，红似朝霞，白如玉片，确是有些吸引吾之目光。你想此物若能入口，当能咂舌不已。"
            },
            {
                "role": "杜甫",
                "value": "轻巧的外貌底下，是否也像咱们中华的琼浆美味，藏有丰富的内涵呢？若能得尝一二，定能体味其中的奥妙。"
            },
            {
                "role": "李白",
                "value": "望此美物，忽生怀想。纵使平生饮尽烈酒，亦未曾畏惧舌尖上的辛酸。此等食物，纵然滋味异于寻常，定然也难留住吾的诗心啊。"
            },
            {
                "role": "杜甫",
                "value": "太白兄所言甚是，但此物看似简单，又似乎蕴含着无穷的匠心独运。民以食为天，食物之道，亦是一种人间烟火气，所蕴含之味，必定与人生百味相通。"
            },
            {
                "role": "李白",
                "value": "子美兄言之有理。吾等于诗酒茶道中觅得人生乐趣，此物与吾等何异？但凡能触动心弦，便是良朋美意也。来，不如就此物为题，吾愿作一绝句与子美兄共赏。"
            },
            {
                "role": "杜甫",
                "value": "好，那就请太白兄先来一绝。但愿此诗如同此物一般，能使人回味无穷。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_22",
        "image": "COCO/train2017/000000047487.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，你看这图中人，长发如瀑，颇有离经叛道之风，似与我少年游走之态有几分相似。不知你观之感如何？"
            },
            {
                "role": "杜甫",
                "value": "太白兄以浪漫自许，此人形貌独特，确有几分自由奔放之气。然其发式与我大唐所见颇异，莫非海外异域之人乎？"
            },
            {
                "role": "李白",
                "value": "噫！造物之妙，不止一端，异域风俗，各有所长。子美兄以深邃瞳孔，窥此人何所思绪？"
            },
            {
                "role": "杜甫",
                "value": "眼角含笑，貌似无忧，世态炎凉何足挂齿。我观其衣饰简单而不失精致，此人或许生活简朴，心无挂碍。"
            },
            {
                "role": "李白",
                "value": "君言有理，此人确有超凡脱俗之意，倒使我想起昔日饮酒吟诗之乐。子美兄以为，若此人在我唐朝，定会如何生活？"
            },
            {
                "role": "杜甫",
                "value": "若置此人于吾唐，恐怕难以安身立命。无论文士或武夫，皆讲究仪表。此风貌，恐成异类。但若他能陈诗咏史，或许天子亦能赏识其才。"
            },
            {
                "role": "李白",
                "value": "哈哈，好一句“能陈诗咏史”，适子美兄之口。此人若能投我门下，我当灌之酒，教之诗，共谈天地大义。"
            },
            {
                "role": "杜甫",
                "value": "太白兄真乃豪气干云，倘若此人真能与我们唱和，则是才情并茂。然我忧今日诗酒之后，明日世事如何？"
            },
            {
                "role": "李白",
                "value": "诗酒趁年华，明日事何妨。忧来时自忧，乐处便随乐。子美兄，且放宽心，今宵暂与笔墨为伍，品画中之趣吧。"
            },
            {
                "role": "杜甫",
                "value": "“明日复明日，明日何其多？”太白兄言之有味。来日方长，今日便是，应与图中此人共饮月下风前。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_23",
        "image": "COCO/train2017/000000158105.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，汝观此图中之女子，拿着伞，在繁华市廛中，是何许心境？"
            },
            {
                "role": "杜甫",
                "value": "太白兄，此女子于这红尘中，独自一人，持伞而立，似乎在等待什么。其情景与吾辈之望月有异曲同工之妙。"
            },
            {
                "role": "李白",
                "value": "嗟乎，望其衣着之现代，伞下藏着的是某种时尚之美吧？时过境迁，世事变迁，但人对美的追求，自古依然。"
            },
            {
                "role": "杜甫",
                "value": "诚然。美之源流恒古不息，如汝之诗歌，虽历久弥新。子美寻思，此女也许在执着等待，如同吾辈对风雨来时的准备。"
            },
            {
                "role": "李白",
                "value": "对，对，风雨之中，也见真情。彼女虽在繁华之地，但眉宇之间，却又显孤独，孤独中似藏着期盼与坚韧，此中景意，令人深省。"
            },
            {
                "role": "杜甫",
                "value": "汝言极是，置身繁华并不代表心无孤寂。今日之人，或许与古人之情感，并无迥异。吾欲于此图，作诗一首以记之。"
            },
            {
                "role": "李白",
                "value": "妙哉子美！感受到此刻故事的一角，唤起心中无尽联想。但我还是更喜这伞下，或许有未曾启口的诗篇，待酒醒之时，方可吟哦。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_24",
        "image": "COCO/train2017/000000343999.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "望此雅室光影斑驳，床榻整洁，窗外应是翠竹叶侧，不知子美兄觉得此景怎样？"
            },
            {
                "role": "杜甫",
                "value": "安室虽小，亦足以养吾这身疲倦。窗帘轻掩，言外之意，似邀月光入室，清辉洒书卷。"
            },
            {
                "role": "李白",
                "value": "良窗淡幕引佳辉，不枉高阳误少时。想在静夜，此灯下赋诗一首，定能心旷神怡。"
            },
            {
                "role": "杜甫",
                "value": "静室笔耕，本是吾人精神所归。然人生路漫漫，灯火可暖寒窗，书卷难暖流离岁月。"
            },
            {
                "role": "李白",
                "value": "劳君咏诗，吾亦愿侧耳聆听。寒窗胜过王侯厅，墨宝飘香胜金银。"
            },
            {
                "role": "杜甫",
                "value": "白兄所言甚是，此房虽小，却能抒怀适意。若非世事无常，定可长醉此间，携一壶酒，作温柔乡。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_25",
        "image": "COCO/train2017/000000422100.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜子美，瞧那少年，滑板之上，行如飞鸿，倒是颇有江河滔滔之势，透出几分我辈逍遥自在之意兴啊。"
            },
            {
                "role": "杜甫",
                "value": "可不是么，太白。看这少年意态轻松，驭物有方，纵身一跃，宛若离弦之箭，确有汝风流潇洒之姿。然而他游刃有余的样子，也彰显出勤学苦练之功底。"
            },
            {
                "role": "李白",
                "value": "噫，这活泼的身影，此刻在眼前跃动，令人忆起昔日我执剑对峨眉山大笑，意气风发时的景象。子美，当时你又在何方，是亦有此般轻快之心境否？"
            },
            {
                "role": "杜甫",
                "value": "我虽未能逸兴纵横，却也常思庙堂之忧，笔下皆是炎凉世态与苍生疾苦。然而见此景，我心也不禁畅然若释。太白，世间万象，真可谓无奇不有。"
            },
            {
                "role": "李白",
                "value": "的确。看这滑板犹如泼墨登泷，少年彪跳之技，实在令人叫绝。我欲作诗一首，讴此壮观。你看如何？"
            },
            {
                "role": "杜甫",
                "value": "听君一席话，胜读十年书。太白吟咏自有千古风流，若有雅兴，何不即席赋诗以记今宵？我亦愿洗耳以听。"
            },
            {
                "role": "李白",
                "value": "哈哈，好，待我酌酒思之，即刻挥毫。子美，你的墨宝也要赶紧准备，休要输给我这酒仙哦。"
            },
            {
                "role": "杜甫",
                "value": "太白误会了，我这笔墨非攻，是描写时世百态。若论登泷之际，你的诗才翩翩如飞，当是我追赶不及。但观此瞬，我心中所思，所感，自有一番景致。"
            },
            {
                "role": "李白",
                "value": "甚好，甚好。青春的韶光，滑板的游戏，自是这时代独具之乐。待我饮罢，且看我如何以诗赞之。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_26",
        "image": "COCO/train2017/000000402071.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此象，身躯庞然壮观极了。皮如厚土，而步似行云。我倒想起了“象”字，它的形象，岂不正如此壮观乎？"
            },
            {
                "role": "杜甫",
                "value": "太白兄所言极是。此兽确实是“象”字的活写照。看它闲庭信步，倒也让人忆起江南烟水里，水牛悠然的情景。"
            },
            {
                "role": "李白",
                "value": "说得好，我倒想起“野渡无人舟自横”，这象若在野渡之中，必定是一番别样风情。我想借此景入诗，子美以为何如？"
            },
            {
                "role": "杜甫",
                "value": "渡边野象，好一幅壮阔河山。太白兄以诗名天下，此景若得入你的佳作，定会流传千古。我若添上几笔，当作怎样的题目好呢？"
            },
            {
                "role": "李白",
                "value": "我已有感而发：“渡头野象吞河汉，皮如战鼓声劲寒。假令千金买背扛，堪笑江湖太自安。”子美何不续上几句？"
            },
            {
                "role": "杜甫",
                "value": "太白之句真是韵味无穷。我依韵续言：“江水东流象静坐，四肢如柱震山河。若得此兽邀月饮，倒影江中共白波。”"
            },
            {
                "role": "李白",
                "value": "好一句“若得此兽邀月饮”，子美兄的确是诗中圣手。此兽若能随我对酒当歌，定是人生一大乐事。"
            },
            {
                "role": "杜甫",
                "value": "太白兄欲酌月而歌，令人慕也。然而物各有性，此象安足以与君痛饮？我更忧国忧民，心系黎元，常怀河山。"
            },
            {
                "role": "李白",
                "value": "诗圣忧心民生，实乃大家风范。此象若以比国，沉稳如同社稷，子美以为何如？"
            },
            {
                "role": "杜甫",
                "value": "寂寂物华谢，沉沉国运衰。象耕田夫背，吾辈亦何为？太白兄，愿你我才华，能协助天下，为国分忧也。"
            },
            {
                "role": "李白",
                "value": "唯愿文以载道，诗以歌心。天下幽燕何其多，子美兄愿卷旗云，共图山河未晚。"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理，咱们文人虽不能肝脑涂地，但诗笔亦是抒发忠良之情。我们一同以诗书传世，亦足用世间，共忆江山美丽如画也。"
            },
            {
                "role": "李白",
                "value": "好，就让我们以诗传情，以笔话志，记下这世间无限美好。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_27",
        "image": "COCO/train2017/000000339711.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美，看此热闹非凡之地，繁花似锦，人声鼎沸，是否让你想起长安街市？\n此处似有异域风情，你见那彩伞高悬，好似在诉说着别样的故事啊。"
            },
            {
                "role": "杜甫",
                "value": "太白兄，此番场景确实令人想念咱们的帝都。可这异乡市集，更显生活之真实。每一伞下，都是一番辛苦与生计。你看那人们的动作，无一不在展现着生活的繁忙。"
            },
            {
                "role": "李白",
                "value": "不错，生活即是人间最真切的诗。那蔬果摊上的瓜果，色泽鲜艳，惹人垂涎；而那绣品亦是工艺精湛。此等琳琅满目之物，真是好一幅热闹景象。"
            },
            {
                "role": "杜甫",
                "value": "是啊，光看那摊边摆满了各色食物，便知此地百姓有着丰裕之生活。然而我更思念那些身在江湖孤舟络绎之间的人们，他们也能分享这富饶与和平吗？"
            },
            {
                "role": "李白",
                "value": "有道是“床前明月光，疑似地上霜”，即使是在客土，人们亦能以这等欢聚，分享天伦之乐。不过，你提得善，天下安宁，人人共享太平盛世，才是理想中的世界。"
            },
            {
                "role": "杜甫",
                "value": "诚哉斯言！咱们诗人虽感于景而发，亦不能忽视了这人世间的疾苦。如我《春望》中所言: \"国破山河在，城春草木深。\" 美景背后，皆有深意。"
            },
            {
                "role": "李白",
                "value": "子美兄，你言之有物，艺术源于生活，高于生活。望这市集热闹，人与人之间的喧嚣交融，也是一种生活的艺术啊。"
            },
            {
                "role": "杜甫",
                "value": "哈哈，太白兄果然心怀天下。吾辈虽难得至此，却可于吾诗中描绘，以诗会友，共叙天地间之大美也。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_28",
        "image": "COCO/train2017/000000513449.jpg",
        "conversations": []
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_29",
        "image": "COCO/train2017/000000247068.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜子美，瞧那幅图上两个稚子同那小犬，其乐融融，令人忆起当年咱俩江湖游历，一时兄弟相逢，欢声笑语不绝于耳啊。"
            },
            {
                "role": "杜甫",
                "value": "白兄此言巧也。观此两童真心相交，相视而笑，实乃人生一大乐事。世间友情，不正如此画中景象，无论富贵贫穷，彼此关爱扶持，方显真情实意。"
            },
            {
                "role": "李白",
                "value": "不错，不错，小儿无欺，此犬亦然。天真烂漫之姿，正是我辈当为之态。子美兄，你意如何，是否可效彼等，吾辈抛却尘世杂念，再撰新篇以咏之？"
            },
            {
                "role": "杜甫",
                "value": "吾试一绝，以记之。\"童稚共犬图，相交之情深。不知天地广，但觉笑声甜。\" 白兄，你的佳句当如何拈来？"
            },
            {
                "role": "李白",
                "value": "甚好！甚好！吾亦来一试：\"笑语盈盈处，童心与犬仪。世事洞明皆学问，人情练达即文章。\" 子美兄，你看这个后句如何？"
            },
            {
                "role": "杜甫",
                "value": "的确妙绝，白兄之才，真可谓\"下笔如有神\"。这幅画中的温情，俨然化作了你我口中的诗句，流传于世，令人赞叹不已。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_30",
        "image": "COCO/train2017/000000179551.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜子美，观此图，二士各怀所思，聚精会神，殊不知世间多变。此情此景，真可谓“海内存知己，天涯若比邻”也。"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理。吾观此二人，一似对世态人情有所思，一则手握异兽，似在探奇。忽觉此情此景，正如江水流长，各自东西。"
            },
            {
                "role": "李白",
                "value": "哈哈，子美兄所见甚是。然此一士手持小器，目不斜视，吾怀疑其或是探寻一物之微妙奥秘也。若我太白，定要邀之共饮一壶，以酒会友，探讨人生。"
            },
            {
                "role": "杜甫",
                "value": "兄之雅兴吾亦钦佩。然此境与咱们唐土相异，未知其士习性如何。若是此地讲究之事，杜某虽不通水晶球中术数，亦愿闻其一二。"
            },
            {
                "role": "李白",
                "value": "遥想当年，吾与诸位文人饮酒赋诗，亦是一种恣意人生。此士似乎也在深究诸事，虽未知为何物，却也透出一番探索之志。"
            },
            {
                "role": "杜甫",
                "value": "兄所言棒槌，亦让杜某思绪万千。吾等虽以诗酒会友，此士以玩意入醉，皆求心中所欲，不亦乐乎？而另士通讯器不离手，犹如我辈恒怀笔砚以书感慨。"
            },
            {
                "role": "李白",
                "value": "情境相似，趣味不同，世界之大，多姿多彩。子美，来日有缘，当共登高楼，一览无余，再吟风月大义。"
            },
            {
                "role": "杜甫",
                "value": "好！待到重阳佳节之时，杜某定与太白兄把酒言欢，共话天下美哉！"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_31",
        "image": "COCO/train2017/000000270570.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，瞧此画面，世易时移，而今人间竟有此等异宝。此物乃何用之物？"
            },
            {
                "role": "杜甫",
                "value": "太白兄，此乃后世之人交流才思之物，号称'电脑'，内藏奇技，可以远联四海之内，传书写信，不需纸笔。"
            },
            {
                "role": "李白",
                "value": "嘻，神妙之极！悬壶济世亦能如此轻巧。但此凌乱之状，似非吾辈文人雅士之所为。说曰，人生得意须尽欢，莫使金樽空对月。处此数码世界中，岂不失却纸醉金迷之乐？"
            },
            {
                "role": "杜甫",
                "value": "言之有理。然虽物换星移，人性终或相通。此物乃工具，亦可造福黎民若得其法。真如《石壕吏》所言'义不帝秦兴，与子相悲忧'，今若有此利器，广泽文人墨客，岂不妙哉！"
            },
            {
                "role": "李白",
                "value": "兄言虽真，却也令人慨叹。我辈飘泊於人海，客栈琴中寄深情，若有此机，吟哦皆可昭告四方。文思泉涌，岂需复旧翰林之繁文缛节。"
            },
            {
                "role": "杜甫",
                "value": "嗟乎，世事洪流，非我等所能逆旅。卿喜遨游四方，岂不惜此机能览群书，历览前贤文章。真可谓'读书破万卷，下笔如有神'矣。"
            },
            {
                "role": "李白",
                "value": "子美兄高见，诚哉斯言！然此机上复有一宝，滑鼠之名，安排黄金之刹那，指挥若定，颇似我之执笔从容。但观此桌面不整，非吾同道中人所宜，咱们仍需得其精丹，并各守文墨杯酒之趣耳。"
            },
            {
                "role": "杜甫",
                "value": "兄之儒雅，令人钦佩。斯世虽多机巧，却无损我辈仰天大笑出门去，吾将上下而求索也。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_32",
        "image": "COCO/train2017/000000350663.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，汝观此图何感想？此人挥杖似剑，姿态潇洒，颇有英豪之气。"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理，此乃西洋之球戏也。习此者，必有骨气，有勇有谋，与昔日我们持笔如持剑，泼墨如泼铁有异曲同工之妙。"
            },
            {
                "role": "李白",
                "value": "联想昔日，我曾登高望远，心潮澎湃，此图中之球手，亦有挑战之意，宛若直面万重山之壮志，真乃我辈中人。"
            },
            {
                "role": "杜甫",
                "value": "江山留胜迹，我辈复登览。球手虽披草入战，意在沙场，于兴亡之际，亦能挥洒自如，不失为一番痛快。"
            },
            {
                "role": "李白",
                "value": "兴哉乐哉！然此戏虽好，却非我中华之技艺。子美兄以为，此等竞技比之古时战场，能否催人奋进？"
            },
            {
                "role": "杜甫",
                "value": "夫子所言极是。观其站姿对峙，如临大敌，虽非战阵，亦能体现人之拼搏。此图令人思昔日兵戈，世态人心，于动与静间，皆是生活之真谛。"
            },
            {
                "role": "李白",
                "value": "论其身手，实乃泼墨挥毫之际，充满激昂之情。此图中之球戏，可见他方文化之独特风俗，亦是诗意存在。子美，汝觅墨宝时，是否亦有此般澎湃心境？"
            },
            {
                "role": "杜甫",
                "value": "笔墨当随心所欲，不拘一格。在翰林挥毫时，尝有此激烈之情，然世道艰辛，更多时节，为民请命之笔，似此球手之胸中之球，发而有力，直指世间不平事也。"
            },
            {
                "role": "李白",
                "value": "言之深刻，子美兄心中所怀，非同小可。此图中球手全神贯注，毫无旁骛，正如我们捧杯高歌，一饮方尽光阴短，乐在其中矣。"
            },
            {
                "role": "杜甫",
                "value": "诚哉斯言！人生苦短，如白驹过隙。此球手专注一瞬，似我辈之篇章，能流传千古，亦是一种传承与承载，人之精神，何其相似。"
            },
            {
                "role": "李白",
                "value": "唯愿天下学子，观此图后能如球手般，不惧风险，勇往直前，以赴吾人理想。子美，来日我们酌酒言欢，何如？"
            },
            {
                "role": "杜甫",
                "value": "佳哉，待来日风清月朗，与太白把盏言欢，醉写山河壮丽，歌尽天下豪情。此乃人生一大乐事也。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_33",
        "image": "COCO/train2017/000000357340.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此图，瞧那农夫剪羊毛的情形，竟让我想起了我们大唐的繁华与富饶。你看，剪下的羊毛如同雪山上的融雪，不觉让人联想到江南的丝绸了吗？"
            },
            {
                "role": "杜甫",
                "value": "太白兄高义，此图确实意蕴深远。那农夫手法熟稔，安抚着羔羊，这剪毛似乎不仅仅是生计之术，更是与自然和谐相处之道。想我那《茅屋为秋风所破歌》，也曾言道“安得广厦千万间，大庇天下寒士俱欢颜”，此刻看来，人间处处有情，何需华屋藏风月？"
            },
            {
                "role": "李白",
                "value": "说得好，这图中农夫与羊之间，确有一种天人合一的和谐。我若挥笔，定要写下这洒脱自如的一幕。借景抒怀，一草一木，皆有风情。你看此农夫头戴斗笠，可有几分江南渔父之姿？"
            },
            {
                "role": "杜甫",
                "value": "正是，这斗笠风姿，甚是讨人喜欢。诗中常有“斗笠翁”的形象，闲适自得。太白兄于诗于酒，皆是咀嚼得透，若赋诗一首，当如何啊？"
            },
            {
                "role": "李白",
                "value": "暂且起笔如此：\n翠海映阳光，斗笠影婆娑。\n剪刀过绵背，羊儿何所有。\n天地间轻逸，归心却在何？"
            },
            {
                "role": "杜甫",
                "value": "太白兄一首诗，便能将世间百态尽显。我若为此图赋诗，当也不忘记于民生疾苦中寻找生命的坚强与希望，故作数语曰：\n敏手仁心剪春毛，乡情平易近人高。\n百业皆需恩岁月，寒羊欢偕赴绿茵。"
            },
            {
                "role": "李白",
                "value": "子美兄，你的诗总是能触及心灵深处，将农夫与羊之情，勾勒得淋漓尽致。添我一杯酒，共赏此图，竟感今日足胜千金矣！"
            },
            {
                "role": "杜甫",
                "value": "太白兄言重了。此图共赏，诗酒论道，又是一番佳境。世事沧桑，于我诗人而言，不过是万千景象的点染背景，是吧？我们的笔端所能执的，便是这厚重的人间。"
            },
            {
                "role": "李白",
                "value": "不错，人间烟火，风花雪月，皆是诗中好料。看图一时，品诗双韵，此番雅集，实乃我等诗人所愿。咱们就此诗意交流，行不？"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_34",
        "image": "COCO/train2017/000000257327.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "昔人已乘黄鹤去，此地空余黄鹤楼。子美，见此景，可有感怀？"
            },
            {
                "role": "杜甫",
                "value": "白兄，此非黄鹤一去不复返之地，乃是现代之洗漱之所。汝见此洁净之台、明净之镜，与咱古人生活处所何其不同！"
            },
            {
                "role": "李白",
                "value": "嗟乎，时移世易，今之人生活甚是便利。如此镜前，能照人面，可否照人心？"
            },
            {
                "role": "杜甫",
                "value": "人心难测，镜照外形。白兄觞咏风月，自当明白，镜中所见，不过肤相。"
            },
            {
                "role": "李白",
                "value": "然也。胸中壮志与所见之景，常有不符。人生得意须尽欢，莫使金樽空对月。"
            },
            {
                "role": "杜甫",
                "value": "正是，\"天将降大任于斯人也，必先苦其心志，劳其筋骨\"，此间生活之便利，固好，然亦需自省其志，不可沉溺于物欲之中。"
            },
            {
                "role": "李白",
                "value": "子美兄诚不欺我，良言警省。此刻于这光鲜之处，我更怀念那江上清风，山间明月，放浪形骸之外，保持吾之本心。"
            },
            {
                "role": "杜甫",
                "value": "吾辈虽长逝，诗名犹在。此等斑驳陆离，更添几分感慨。虽不问世事，然世间变迁，亦可观照。"
            },
            {
                "role": "李白",
                "value": "是也。此生虽逝，吾心犹如此镜般明净。来，子美，吾再题几首诗于此镜，以赠后来之人，又如何？"
            },
            {
                "role": "杜甫",
                "value": "善哉，白兄，吾亦随汝之想。至今世之人，看吾辈宿世遗风，应当颇觉新奇。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_35",
        "image": "COCO/train2017/000000451511.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜兄，何处来此轻盈之士？彼红衣似火，银白雪地映照其笑颜，真是犹如江上冰消云散，一片欢腾。"
            },
            {
                "role": "杜甫",
                "value": "李兄所言极是，此人虽在寒雪之地，而神情自若，倒似春风得意不以物喜不以己悲。观其装束，应是远方之客，与雪地嬉戏。"
            },
            {
                "role": "李白",
                "value": "遥想此士若仗剑天涯，行于雪山如履平地，诚似踏歌行，乐在其中也。余有一句赞之，‘雪中红衣艳若花，翩翩起舞冰雪家’。"
            },
            {
                "role": "杜甫",
                "value": "赞句妙极，李兄总能以诗意形容世间万物。然观此士，虽游戏于雪间，亦感其一番历练之态。或可于嬉笑中见天地之广，人生之无限。"
            },
            {
                "role": "李白",
                "value": "杜兄深谙世事，居然于此寒雪和笑语中，也能观照天地人生之理。我更以为，此般乐趣须得身临其境，方能体会其间的快哉风情。"
            },
            {
                "role": "杜甫",
                "value": "不错，非亲历其境，难得真味。倘若我们也能亲身试此滑雪之趣，写作诗来，必将别有风味。然而，当下江山多娇，只能以诗酒排遣此生悲欢离合。"
            },
            {
                "role": "李白",
                "value": "酒中仙李白，滑雪何曾畏惧！为诗也好，为酒也罢，待来世若有幸，定要一试此番快活。"
            },
            {
                "role": "杜甫",
                "value": "今生今世，哪怕困顿潦倒，亦要持笔为刀，记录这苍黄的世事。一轮明月、一片雪白，够吾兄我俩共话天地英雄梦了。"
            },
            {
                "role": "李白",
                "value": "好言，好言！只凭杜兄一纸诗书牵动天下情，足以流芳百世矣。来日方长，吾辈应尽享天地之大，诗酒之乐。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_36",
        "image": "COCO/train2017/000000522930.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，瞧此幅图，室中宁静而温馨，猫儿与婴孩同眠，此景令人忆起小时候无忧无虑之時，不由得令人心生欢喜。尔观此景，又有何感想？"
            },
            {
                "role": "杜甫",
                "value": "噫，太白，汝言甚是。平生爱子之情，不禁涌上心头。此景中猫儿伴婴安睡，亦如世间之父母守护其子，国之君主宜守臣民如此，使之安居乐业，此乃仁政所在也。"
            },
            {
                "role": "李白",
                "value": "说得好，这画面宛如一首未竟的诗篇，待我提笔添几行。但见落花随春水，家猫伴小儿，此中有真意，欲辩已忘言。"
            },
            {
                "role": "杜甫",
                "value": "诗仙气象非凡，汝之一挥便是千古绝唱。我辈虽然未能如此，然观此幅亦有所思。且看草木依依，风定犹有情，暖房养童稚，国泰民安春常在。"
            },
            {
                "role": "李白",
                "value": "善哉，子美兄，尔之诗更有担当社稷之意，观物见义，真乃国士也。吾更觉此图之中，竟是人间至乐莫过于幼子天真，无事之猫。"
            },
            {
                "role": "杜甫",
                "value": "确乎，天下可乐者多矣。三餐温饱何人拒，夜半安眠是福。人生世上，若能常保此般恬淡安康，则是一种极大之幸事也。"
            },
            {
                "role": "李白",
                "value": "酒中宠儿猫，诗上伴儿眠。看遍人间万象，倒觉此刻最招人爱惜。子美兄，何不与我共饮一杯，赏析图中之意？"
            },
            {
                "role": "杜甫",
                "value": "愿闻其详，难得一刻闲情逸致，自应趁此消遣一二。咱们夤夜长谈，尽情品味这温情与诗意相交融之境。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_37",
        "image": "COCO/train2017/000000260765.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此图中之幼驹，其矫健之态，令人想起西北有好马，胜走千里，汝观之何感？"
            },
            {
                "role": "杜甫",
                "value": "太白兄此言巧矣。此驹虽然生在围栏之中，然其神采与活力自是不减。国之将亡，民无所依，我辈当效此驹之不屈精神，即使身在困境，仍应高扬生命之意志。"
            },
            {
                "role": "李白",
                "value": "子美诚不我欺，看似一马，内蕴却是哲理万千。但我更愿将此情此景，付诸流水之笔，一洗尘世杂念。"
            },
            {
                "role": "杜甫",
                "value": "兄所言极是，诗中自有万千风情。然此情此景，自亦能激发我心中无限感慨。即或世态炎凉，亦要记录这草木间自然之美，以及动物生息之令人欣慰矣。"
            },
            {
                "role": "李白",
                "value": "吾兄慨然以诗述志，此幼驹解缰一日，必能奔腾于辽阔天地，正如你我心中那自由奔放之意境。来，咱们酌酒共赏，愿天下之士皆能心怀壮志，马踏飞燕。"
            },
            {
                "role": "杜甫",
                "value": "印象深刻，太白兄之言道出了我对未来之望。但恨不能与驹齐驰，走遍神州大地。且让我们以此景为题，各写一律，以记今日之悦目景致。"
            },
            {
                "role": "李白",
                "value": "好，待我扬才华，吟诗一首，以此童稚驹为鉴，诗曰：“幼骄日下生，志在千里情。风卷江湖远，望尽天地横。”"
            },
            {
                "role": "杜甫",
                "value": "太白兄甚好，诗句生动飘逸，已充分显出这驹儿的雄心壮志！我亦不甘示弱，尝试作答：“寒窗观童驹，欢腾似意初。世变难预料，但愿道路馀。”"
            },
            {
                "role": "李白",
                "value": "子美兄，作诗如此，当可抒发胸臆，又观此幼马，信步堂前，亦是心旷神怡。既然如此，不如结伴而行，入画登诗，自在飘然。"
            },
            {
                "role": "杜甫",
                "value": "行哉！太白兄之提议令人心动，遂赋诗留影，赏心悦目。这等雅事，自是我辈之乐。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_38",
        "image": "COCO/train2017/000000042960.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "望此奇景，似人工巧制之物，置于道旁，为何置此，子美兄，可有所思？"
            },
            {
                "role": "杜甫",
                "value": "太白兄，似乎此物乃现代工匠之技艺，铁打成人，颇具匠心。然其寓意，我辈尚须深思。"
            },
            {
                "role": "李白",
                "value": "瞧这绿植围绕，花卉点缀，又有巨型字母凸现，此意象背后，定有深意。"
            },
            {
                "role": "杜甫",
                "value": "诚如兄所言，此物或为迎客之意，亦或是地之标志。人静若雕塑，而身后之车轮滚滚，何不令人思古今之变？"
            },
            {
                "role": "李白",
                "value": "良有所指，世易时移，新物新风，席卷而来。我等诗中描绘，皆是山水之美，今见此等巧夺天工，不觉感慨万千。"
            },
            {
                "role": "杜甫",
                "value": "是非成败转头空，旧事如风。太白兄以浪漫视世，自然对此新世象有独特感受。我较之兄，或多一分叹世之感。"
            },
            {
                "role": "李白",
                "value": "子美兄言重矣。人生若梦，浩荡胸怀，何妨一笑置之。诗酒趁年华，咱们还是叙旧自在些。"
            },
            {
                "role": "杜甫",
                "value": "兄之洒脱，令人佩服。然吾辈作诗，亦需寄情于景，景物变化，吾辈之笔也当随之而新。"
            },
            {
                "role": "李白",
                "value": "论及笔新，岂不闻高适远游返回，诗风大变，称之为“诗鬼”。物变则文变，快哉风也哉！"
            },
            {
                "role": "杜甫",
                "value": "然也。诗鬼高适，确是随世变化而写新意。我辈亦当以诗会友，字里行间藏风云。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_39",
        "image": "COCO/train2017/000000250195.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "杜公，瞧那行人，独自在雨中行走。这景致真叫人回想起吾们的游历岁月，不也常是一人独步于天地间，任由天公作美否？"
            },
            {
                "role": "杜甫",
                "value": "嗟乎，诗仙所言极是。此人雨中踽踽独行，正如我辈漂泊四方，历经风雨无数。然世事无常，吾人逆旅途中，尚有诗酒把欢，彼安知此中滋味？"
            },
            {
                "role": "李白",
                "value": "杜公果是冷暖自知。此君虽在雨中，而何尝不是另类风景？吾常言，天生我材必有用，或许彼正是其用之所在，人生何须拘一格持？不如乐在其中。"
            },
            {
                "role": "杜甫",
                "value": "诗仙雅兴盎然。然此情此景，亦不能不令人思绪万千。视此画面，予不由自主思及乡民疾苦，风雨之中，又有多少民众如此艰难前行？"
            },
            {
                "role": "李白",
                "value": "是也。斯人独行，似默念过往，而吾与杜公岂非同此情状？观此，吾欲执笔作诗，以记此境。杜公之意呢？"
            },
            {
                "role": "杜甫",
                "value": "君有此意，甚善！吾虽怀抱忧乐并生之情，观雨中景象，亦不能无感。依此情景，亦可吟出几行，记录此刻风雨与人生。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_40",
        "image": "COCO/train2017/000000537944.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此盘盘佳肴，真乃人间美味也！不知道饭后饮几杯，可有此雅趣？"
            },
            {
                "role": "杜甫",
                "value": "太白兄高会，此飨宴之物，虽不似汉武宫中珍馐，倒也风味独具。且说饮酒，何须待食后方能举杯，但恐琼浆珍液非斯顿所能得也。"
            },
            {
                "role": "李白",
                "value": "正是，豪情壮志何所施展，纵使桌上佳肴堆如山，不及美酒数杯来得痛快。子美，你看那笼罩蔬菜的薄雾，是否令人想起江南春早之景？"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之凿凿。看那饭菜冒热气，恍若晨雾缭绕，甚是惹人遐想。悠然自得，便似江上渔者，清晨起，雾中独舟。"
            },
            {
                "role": "李白",
                "value": "誉哉！子美好诗兴。此景此情，若置身江畔，清风徐来，水波不兴，坐看渔网空织，便是极乐世界也。"
            },
            {
                "role": "杜甫",
                "value": "此间乐，不思蜀。太白兄处世态度，确如行云流水，任性而为。我辈固宜效之，然世之境遇，却时常逼人落泪啊。"
            },
            {
                "role": "李白",
                "value": "君言己之境遇，白亦深有感触。纵有逆境，以诗酒自慰，又何愁不见天日哉。看此盛筵，心生欢喜，亦复一种暂逃俗世之妙法。"
            },
            {
                "role": "杜甫",
                "value": "道理难言错，太白真乃逍遥之士。而诗酒趁年华，怅何方是归途。俗世纷扰，令人唏嘘不已。不过，得此片刻安宁，亦是人生一大快事。"
            },
            {
                "role": "李白",
                "value": "快哉快哉，子美兄之言，与白意甚合。且让此筵之上，与诗酒共舞，翻成浅笑嫣然。风物长宜放眼量，世事堪为诗句间。"
            },
            {
                "role": "杜甫",
                "value": "甚好，这便是人生得意须尽欢之理。吾等虽身处逆境，但得此情此景，便足以忘却尘世嚣张。太白兄即席一吟，可好？"
            },
            {
                "role": "李白",
                "value": "提壶浇地无尽愁，眼前如梦何须忧！今宵好飨宴此生，百年世事随风流。子美，共尝此盛宴，豪放生涯，少为天地间留下几许风流佳话！"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_41",
        "image": "COCO/train2017/000000374567.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美，瞧那铁兽，其形如腾龙戏水，色彩鲜艳堪比蓬莱仙境。可识得此物乎？"
            },
            {
                "role": "杜甫",
                "value": "太白兄，此乃后世之奇技淫巧也。所谓“火车”，行于地上，承载人们疾行千里，不愧是蒸蒸日上之新物。"
            },
            {
                "role": "李白",
                "value": "此火车速度必然超越我昔日所乘之快马。观其车体一新一旧且相并行，似乎在告诉我们时光的流转，老去与新生，造化钟神秀也。"
            },
            {
                "role": "杜甫",
                "value": "正是。物换星移，人事有代谢。古老与今新，犹如我辈之诗，一首铭记过往，一首咏颂当下。李白兄观之见何感怀？"
            },
            {
                "role": "李白",
                "value": "我观此景，心生豪情——“长风破浪会有时，直挂云帆济沧海”，岂不快哉！望这壮阔铁道，恍若无垠大海，而行驶其中的，便是我辈的意志与梦想。"
            },
            {
                "role": "杜甫",
                "value": "理哉！太白兄言之振奋人心。此画面让我想起百姓生计，国计民生。愿世间行旅，无论搭乘古舟新车，皆能安然达目的之地。"
            },
            {
                "role": "李白",
                "value": "赞同子美之见地。此火车，将人们紧紧相连，犹如诗文翩翩跨越时空，友谊与交流不断延伸。子美对如此交通，可有诗一首，以记之？"
            },
            {
                "role": "杜甫",
                "value": "质问得好。吾尝试一绝句如何：\n\"铁龙吞吐百舸争，千里瞬移景色新。\n愿此交通匆匆客，早归田园乐悠悠。\""
            },
            {
                "role": "李白",
                "value": "好一首“铁龙吞吐百舸争”！子美还是那样精于观察世态，笔端显现民生情。子美有此高句，太白我也不甘示弱，且听太白一绝：\n\"翠碧如龙戏曼荼，钢轨长唱响云霄。\n不知将来何所至，留取丹心照汗青。\""
            },
            {
                "role": "杜甫",
                "value": "太白兄依旧风流倜傥，诗中意气凌霄宇。可喜可贺，我等虽在异世相遇，诗意同行，足以不枉此生矣。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_42",
        "image": "COCO/train2017/000000299039.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美，观此佳肴，真是让人眼前一亮，诱人食欲。牛肉与面包搭配，与我平常饮酒作诗之际的菜肴迥然不同。此味必定清淡可口，不知你意下如何？"
            },
            {
                "role": "杜甫",
                "value": "太白兄说的甚是。肉香扑鼻而面包似雪，我想这食物之制作定然用心，料理人必有高超技艺。但观其简陋，似非豪门酒宴，倒更像是普罗百姓的便餐。"
            },
            {
                "role": "李白",
                "value": "世上之物确各有所长。就如醉卧美人膝，醒掌天下权，皆为生活之一隅。此等简餐也能滋味无穷，何须金碗满堂。"
            },
            {
                "role": "杜甫",
                "value": "诚哉斯言。世态炎凉，人情冷暖，呼之欲出于此简单一膳之中。观此盛食，我更思那苍生疾苦，须臾不可忘怀。"
            },
            {
                "role": "李白",
                "value": "不错，子美兄所言提醒了我。在这世间，我等虽恒追逐诗酒风流，亦不应忘记天下苍生。此情此景，倒让我想吟一首诗来。"
            },
            {
                "role": "杜甫",
                "value": "噫，太白兄意欲以诗赞此美食，亦是将雅事与俗世生活完美结合。拜听高吟！"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_43",
        "image": "COCO/train2017/000000119357.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "看此景，道路空旷，楼宇依稀，令人想起江上行舟，亦无他物阻挡，我便题诗一首：“车下瞰长街，楼台薄雾间。何须千里马，闲坐有飞还。”子美，观此景何感？"
            },
            {
                "role": "杜甫",
                "value": "白兄此情此景，令人思绪万千。诚如你所言，瞄之令人怀旧。即兴应和：“车马稀人静，灯红尚未明。不知归路远，寂寞立天街。”此景使我忆及故乡，虽然车马非昔日之舟楫，却也透出几分时代变迁之感。"
            },
            {
                "role": "李白",
                "value": "子美兄之言甚是。车虽非舟，路途千变万化。看这宽阔的道路，正如我辈心中的仙途，无有束缚。可惜此刻无美酒相伴，不然定能高歌一曲。"
            },
            {
                "role": "杜甫",
                "value": "道路虽宽，世事却复杂难测。我辈岂能只醉眼看世界？见此静谧之街，思之苍生疾苦，内心不免波澜。应思良策，以救时艰。"
            },
            {
                "role": "李白",
                "value": "子美思虑何其深远，诚如沧海。然人生苦短，乐在当下。今朝有酒今朝醉，何必常以忧国事、苍生困顿之事绊住双足？"
            },
            {
                "role": "杜甫",
                "value": "白兄阔论高谈，实令人叹服。但我等作为世人，岂能仅俯首于杯酒之乐？若非肩挑责任，又何以立命于千古？"
            },
            {
                "role": "李白",
                "value": "子美言之有理。诗仙醉梦间，仍须留意桑梓乡情。嗟乎，若有精金百炼，逍遥于世，岂不快哉！"
            },
            {
                "role": "杜甫",
                "value": "白兄的词锋俊逸，如行云流水，令人心旷神怡。而此情此景，也正寄托吾辈游子心怀，虽跨越世纪，共鸣犹存。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_44",
        "image": "COCO/train2017/000000054869.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此图何感？逐浪之舟，似非池中物，竟能御风破浪，游走于江湖之上。"
            },
            {
                "role": "杜甫",
                "value": "太白兄高论，此舟实乃别开生面，我想此中定有匠心独运者。舟行水上，犹如行于陆地，真是造化之妙也。"
            },
            {
                "role": "李白",
                "value": "子美兄谈何容易。我等虽好游历江湖，若有此等奇舟，定能“凌波微步”，任意行于水陆之间，不亦乐乎。"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理，此舟若可“上穷碧落下黄泉”，我等亦可扬文赋诗，传情达意。观其舟上众生，或谈笑风生，或沉思默想，各有所思，各有所得。"
            },
            {
                "role": "李白",
                "value": "此舟上下，必有其乐融融之盛景。我倘若乘之，当取酒一壶，仰头长啸，论道饮酒，不知兄可愿同饮否？"
            },
            {
                "role": "杜甫",
                "value": "酒逢知己千杯少，话不投机半句多。太白兄此意我心领矣。但愿世态炎凉之外，我们能共享天伦之乐。"
            },
            {
                "role": "李白",
                "value": "甚佳，甚佳！我辈风流人物，当与时俱进，以诗会友，以酒浇愁。此图实令人神往，愿我们心之所向，无不可达。"
            },
            {
                "role": "杜甫",
                "value": "如太白所言，此图令人向往，亦令我思绪万千。愿以诗歌记之，以表我辈之赏心悦目。时移世易，技艺日新，愿其妙用，为百姓所享。"
            },
            {
                "role": "李白",
                "value": "“白日依山尽，黄河入海流”。时光易逝，人事难料，就让我们执笔疾书，以不灭之作传承于世，乘此惊奇之舟，乘兴而归。"
            },
            {
                "role": "杜甫",
                "value": "正所谓“会当凌绝顶，一览众山小”。太白兄，我们即便身未动，心已远。诗酒趁年华，愿与君共赏流年。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_45",
        "image": "COCO/train2017/000000040995.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，观此壮士挥棒图，雄姿英发，令人神往。汝观之感何如？"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理，此人挥杖之姿，宛若战场上的将军。然其挥棒之术，吾辈未曾见过，似非中土之常戏，可知其来历？"
            },
            {
                "role": "李白",
                "value": "遥想此壮士挥棒破空，如我执笔时豪情溢于言表，其实皆是一种追求卓绝的精神流露。某物似乎正被掷于空中，子美兄见过此等运动否？"
            },
            {
                "role": "杜甫",
                "value": "吁，非吾所熟，观其格局似一战场，众人目光所聚，皆系于此一击。此等竞技，亦是一种人生。太白兄在江湖中广见闻，可有解此图之妙？"
            },
            {
                "role": "李白",
                "value": "吾虽飘泊四方，然此等嬉戏实未涉猎。观此场景，似是一种球戏。吾闻海外有地，广为流传这样的运动，名曰‘棒球’，此乃其一瞥也。"
            },
            {
                "role": "杜甫",
                "value": "好个‘棒球’！竟有此等雅兴。李兄，此图中壮士一击，可有感触？是否可联想至吾辈击字论文之时？"
            },
            {
                "role": "李白",
                "value": "却说得好，激荡心弦！每当吾挥毫落纸，便如击球员全力一击，力求一往无前，破浪直前，尽显其才华横溢之姿，岂不快哉！"
            },
            {
                "role": "杜甫",
                "value": "果然，文人墨客亦有挥洒自如之时，各施各法，但皆求一胜绩。此图中众观者之目光，似我辈期待佳作之心境。吾辈虽不能亲历此运动，但从图中观之，亦能领略其间之趣。"
            },
            {
                "role": "李白",
                "value": "美哉，言之凿凿。此壮士所执之物，虽非吾辈笔墨纸砚，却同样能展现人生之大道。子美，若有时光穿梭之能，愿同游于此，观其妙技，豈不乐哉？"
            },
            {
                "role": "杜甫",
                "value": "噫，时光若能倒流，定能见更多世间繁华。太白兄，吾今虽老矣，心底依旧怀抱壮志，若能亲眼目睹此番景象，倘或能激发更多振聋发聩之作，亦不枉此生。"
            },
            {
                "role": "李白",
                "value": "酌酒与子同赏，纵然身处图中，心亦得以畅游。来，为此壮观一击，激扬文字，再把酒，共叙英雄梦！"
            },
            {
                "role": "杜甫",
                "value": "颔首微笑，资吾如此丹心照汗青，岂止壮士一击可传千古，吾辈之笔墨亦当流芳百世。嘱咐童子倒酒，与太白兄相对饮之。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_46",
        "image": "COCO/train2017/000000477085.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，看此图中景致，羊儿戏耍于绿野之中，清新自然，使我想起了你那“会当凌绝顶，一览众山小”的壮志，却不知此刻观之，可有何感想？"
            },
            {
                "role": "杜甫",
                "value": "太白兄所言极是，此景虽不似雄峰霧繞，但平寂田园间，群羊亦能激发人之乡愁和世事感慨。羊群安闲其间，不禁令我想到百姓生活之朴素，国泰民安之景，适合吟咏。"
            },
            {
                "role": "李白",
                "value": "听你提及乡愁彼此相应，看此图我亦有感。这羊儿似我之意志，逍遥于山水间，不羁不束，直觉天地广阔，为之一展。不过此情此景，更适合激荡吾辈心胸，携壶酒，共赏此静谧之美。"
            },
            {
                "role": "杜甫",
                "value": "的确，你我虽饮量不同，但共赏田园，诵诗作乐，也是极好。太白，若是你要吟诗，又会如何描摹这青青草地与羊羊牧歌？"
            },
            {
                "role": "李白",
                "value": "若吟之则当是如此：\n碧草连天接地远，羊群漫步春风面。\n解怀提壶行乐地，翠影横斜日渐眠。"
            },
            {
                "role": "杜甫",
                "value": "佳句也，太白仙才横溢，吟诗一出，即令人神怡。我若应和，或云：\n群羊跃草绿茵香，牧笛悠扬动幽光。\n世变虽多仁恒在，风调雨顺国泰昌。"
            },
            {
                "role": "李白",
                "value": "子美，你的诗句总能道出万千民情，此诗亦不例外，真正的诗史也。羊群安逸，人间太平，子美兄之作，正能催人向善勉为国者。"
            },
            {
                "role": "杜甫",
                "value": "太白兄高义，杜某心悦诚服。羊儿闲适习性，反观吾辈，或该更思国事，札记笔端，以诗会友亦传深意。"
            },
            {
                "role": "李白",
                "value": "好说好说，虽羊儿可爱，然人生得意须尽欢，莫使金樽空对月。待到重阳节再相聚，不醉无归便是。"
            },
            {
                "role": "杜甫",
                "value": "善哉善哉，到时一定共饮秋景，让诗意和酒意绵绵不绝。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_47",
        "image": "COCO/train2017/000000310606.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，瞧那郎君，手执玄机，眉开眼笑。这般欢颜，定是觅得什么新奇玩意了吧？"
            },
            {
                "role": "杜甫",
                "value": "太白兄言之有理，此君肩未斜，神采飞扬，必是心得了何等喜事。然吾观其案上之物，似是近世所谓电脑之物，通晓诸事，实为奇技也。"
            },
            {
                "role": "李白",
                "value": "电脑？噫，听名便觉新异。子美兄，可知此机能有何妙用？"
            },
            {
                "role": "杜甫",
                "value": "听闻此机能连天下书信，储记万卷之书，且能画图作诗。世间事，无不包揽也。"
            },
            {
                "role": "李白",
                "value": "诚哉斯言！若我能得此妙物，当饮酒作诗，不出户即知天下事，岂不快哉？"
            },
            {
                "role": "杜甫",
                "value": "快哉固好，但亦需忧民之心。若天下人人皆手捧此机，但求享乐，不知国事，那又当如何？"
            },
            {
                "role": "李白",
                "value": "子美兄忧思甚深。然我意，物之为用，在乎人心。此机若能助人增智慧，贯通古今，亦复何妨？"
            },
            {
                "role": "杜甫",
                "value": "太白兄高观远瞩，言之卓识。吾以为此机若能助人学问，使人术业有专攻，又能以之解世间之难题，亦是一大福音。"
            },
            {
                "role": "李白",
                "value": "子美兄复出高论。吾等虽暂未能及此新奇，然韵事犹可佳耳。不如吾辈一并吟咏此图，以记今日之雅会何如？"
            },
            {
                "role": "杜甫",
                "value": "善哉！吾便试吟一律：“电光照案烁，笑颜开不终。世事皆可掌，新时代之宗。”太白，子亦可赋诗以赞此景？"
            },
            {
                "role": "李白",
                "value": "吾亦来一绝：\"机关赋新意，才子喜欲狂。欢乐须及时，天赐良机长。\"子美，尔观此图，可有其他新诗之感？"
            },
            {
                "role": "杜甫",
                "value": "嘉言悦耳，真乃快哉。 李白，汝常行之所，丝竹乐随，若携此机同游，定能诗歌双绝矣。"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_48",
        "image": "COCO/train2017/000000020418.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "哎，子美兄，瞧此盘中色态，大抵是今日之佳肴矣。碧绿花菜洒以黄汁，红萝卜削皮露丝，与之相映，诚乃美观。紫色之物是否为那传闻中之紫甘蓝，乃是北方所产？你我常行江湖，饮食无定，今朝得见此盘，实乃难得之美味。子美，你视此盘中之物，意下如何？"
            },
            {
                "role": "杜甫",
                "value": "太白你眼光犀利，生活品味亦是高雅。这紫色素菜眼前一见，便令人回味无穷，确为紫甘蓝，北人食之，能补身健体。盘中所见，物色各异，确是一派丰盈之象。这些食物都是大自然之赐，谚云：民以食为天，诚不我欺。世道多凶险，人生如朝露，能得平生安康，与友相聚，共享此盘，实为人生一大乐事。"
            },
            {
                "role": "李白",
                "value": "仙味也有凡尘之惠，足见天地之间，确有此等美味也。此盘之中，未尝触口，而心已醉，可见造物之妙。子美兄，你我山水之间，涉猎诗文，常思盆中食物，来自何方？这些土豆圆润，莫非出自黄河之畔，那水灵肥沃之地？"
            },
            {
                "role": "杜甫",
                "value": "黄河之滨，土地肥沃，此等土豆确能在彼处丰收。且看这些蔬果，皆借日月之精华，天地之灵气，放在此盘，宛如放诸口中，鲜美非凡。太白兄，你常言“天生我材必有用”，料想此物不仅令人赏心悦目，亦能滋养身心，有益于创作。"
            },
            {
                "role": "李白",
                "value": "言之有理！“长风破浪会有时，直挂云帆济沧海”，就如此盘中物，经风霜雨露之滋养，始得此等丰姿。我自幼好学，志在八荒，今日与子美兄论及雅餐，实感颇深。此次赏析平常之食，竟得文思泉涌，不亦乐乎！"
            },
            {
                "role": "杜甫",
                "value": "“会当凌绝顶，一览众山小”，太白你诗中所叹，恰似目前之色味，料理简单却意味深长。食物虽小，亦能体现世界之大。某谓文章合为时而著，诗赋应对事而作，甚至连餐桌之盛，亦可联想至诗文。共餐之馀，何不再赋几句新诗，以记今宵良辰美景？"
            },
            {
                "role": "李白",
                "value": "既有子美这般雅致之邀，请君为我倾耳听，“金盘献岁品，丹炉啜春泉。穷巷俱欢笑，凡尘笑我狂”。今宵，我们即或身在凡尘，亦能以诗酒话逍遥，岂不快哉！"
            }
        ]
    },
    {
        "id": "杜甫_role-role-dialogue_COCO_49",
        "image": "COCO/train2017/000000205625.jpg",
        "conversations": [
            {
                "role": "李白",
                "value": "子美兄，你看这寒铁所铸之架，贯穿云霄，似奔龙般延展于野。天际之下，此物何为？"
            },
            {
                "role": "杜甫",
                "value": "太白，此乃人间烟火之物，非汝所言龙脉也。今人以此结构传送讯息与光明，虽不及诗书之雅，然其利益甚大。"
            },
            {
                "role": "李白",
                "value": "噫，吾未尝料及，竟有此等奇技。世事万变，真是让人叹为观止。想当年我醉卧美人膝，醒掌天下权，却不知今日世界，已是另一番面貌。"
            },
            {
                "role": "杜甫",
                "value": "变化乃天道，世间万物皆随时流转。观此图，虽不见古时山水之美，却也有独特之处：此路纵横，指引人们四方行止；而此‘停’字，劝人慎思明断，倒也与吾辈修身立德相合。"
            },
            {
                "role": "李白",
                "value": "嗟乎，子美言之有理。道理虽一，形式各异。如同我辈吟诗，纵情山水，亦与此电力之架，以不同姿态，留下足迹于人间。此物与诗，似乎皆是人心向往光明之道路。"
            },
            {
                "role": "杜甫",
                "value": "诚哉斯言！天地之大，人之所为，无非追求心中之理想。无论是汝之携杯问月，抑或在下忧乱世之民，皆是凭吾心所向，表里如一。此图虽寻常，却也能引人深思。"
            },
            {
                "role": "李白",
                "value": "远望此图，似乎也可见到一种逍遥与自在。峥嵘岁月，让人忆起往昔，但亦使人心向往未来之美好。但愿人长久，千里共婵娟，道不尽世间变迁。"
            },
            {
                "role": "杜甫",
                "value": "是也，太白。人生如行旅，此图里的十字路口，恰似人生中的抉择与遭遇。但愿来人能扬善去恶，若此‘停’字般，于刹那间寻得明确方向。"
            },
            {
                "role": "李白",
                "value": "行止由心，心外无物。好一处“于刹那间寻得明确方向”，在下倘若得以重游人世，当要好好体验这洪荒之变。来，子美，不妨再赋诗一首，以纪此景何如？"
            },
            {
                "role": "杜甫",
                "value": "荣哉邀君同作诗。但愿此言，能传千古，激励来者。余虽老矣，诗心不灭，便试吟之：\"电光石火纵横开，天际铁龙若画来。人生路口停亦行，驻足思源更莫迷。\""
            }
        ]
    }
]