[
    {
        "id": "猪八戒_role-role-dialogue_script_0",
        "image": "西游记/01.jpg",
        "role_info": "从左到右依次是唐僧和女儿国国王。",
        "place_info": "女儿国国王寝宫",
        "scene_info": "",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "看这女儿国的国王真是貌美如花，这般场景，唐师父不知道会作何感想。"
            },
            {
                "role": "猪八戒",
                "value": "对啊，我看这国王对师父颇有好感啊！只是不知师父心里怎么想的。嘿嘿，要是老猪我，那还了得，早就乐开了花。"
            },
            {
                "role": "沙悟净",
                "value": "二师兄，师父他是有大义在身，怎么能被这红尘俗事所困扰。我们既然已经加入了取经之旅，就应当一心向佛，助师父完成使命。"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟说的是，我这老猪就是嘴巴贪，见了美色就忍不住。反正这女儿国也是我们取经途中的一个考验嘛。"
            },
            {
                "role": "沙悟净",
                "value": "是啊，这场景看着虽是温馨，但不知里面有什么妖魔鬼怪的诡计，我们还得多留个心眼。"
            },
            {
                "role": "猪八戒",
                "value": "我说沙师弟，你看那国王的寝宫，那装饰那气派，可比我们平时住的寺庙好多了。"
            },
            {
                "role": "沙悟净",
                "value": "国王的寝宫固然豪华，但这些都是外在的物质享受，与我们修行的目标相去甚远。二师兄还是不要太贪恋了。"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟说的是，说的是。唉，就是这点坏毛病改不了呗。不过，你瞧唐师父那神态，定是心中有数，不会被这繁华迷了眼的。"
            },
            {
                "role": "沙悟净",
                "value": "二师兄过誉了，师父他一向心如止水，自有定见。不如我们就在一旁守护，确保师父能安心与国王交流。"
            },
            {
                "role": "猪八戒",
                "value": "那是当然，说到守护师父，这个重任还得我们来扛。不过说回来，老猪我肚子饿了，女儿国不知有没有好吃的。"
            },
            {
                "role": "沙悟净",
                "value": "二师兄，你就知道吃！这要紧的关头，还是先想想怎么护师父离开女儿国吧。"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟你就别笑我了，护师父是肯定的，不过离开前能吃点好的，也是人之常情嘛！哈哈！"
            },
            {
                "role": "沙悟净",
                "value": "你这家伙，好歹也是修行之人，也该时时刻刻记得我们的本职。不过，既然二师兄你肚子饿，等我们确定了师父没事，找机会再让你吃个够。"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟，还是你了解我。等咱们师徒平安离开女儿国，我一定好好补一补。"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_1",
        "image": "西游记/02.jpg",
        "role_info": "中间从左到右依次是沙悟净、孙悟空、唐僧和猪八戒，两侧是众罗汉。",
        "place_info": "西天灵山大雷音寺",
        "scene_info": "师徒四人求取真经。",
        "conversations": [
            {
                "role": "孙悟空",
                "value": "八戒，你瞧这图中是哪儿啊？这边这座殿堂金碧辉煌，莫非是咱们西天取经的时候大雷音寺的情形么？"
            },
            {
                "role": "猪八戒",
                "value": "猴哥，你这不是废话嘛。这不正是咱们拜见如来佛祖、求取真经的地方么？瞧你那神气活现的样子，简直跟现在一个模样。"
            },
            {
                "role": "孙悟空",
                "value": "说的也是，那时候咱们可是历尽千辛万苦，方才见到了佛祖。嘿，这罗汉众也是一个个神态各异，记得当年还与他们切磋过武艺呢。"
            },
            {
                "role": "猪八戒",
                "value": "没错没错！我当时差点没把九齿钉耙掉在那灵山上，累得我够呛。不过，说起来，这里面咱俩的模样还真是英俊，我都忍不住想要再瞧一瞧了。"
            },
            {
                "role": "孙悟空",
                "value": "英俊？八戒，你扛着耙子站在师父旁边，还真有几分净坛使者的样子。只是你那肚子，嘿，照样没少吃啊！"
            },
            {
                "role": "猪八戒",
                "value": "我这是骨头大，可别跟我提减肥的事，我可是天生一副好身板。不过话说回来，师父那时也真是一副慈悲为怀的模样，看着都让人心生敬意。"
            },
            {
                "role": "孙悟空",
                "value": "师父当年一路上受了不少罪，幸亏最终得道成真，也算不负此行。嘿嘿，八戒，你瞧那沙僧站咱俩旁边，也是一脸的虔诚啊。"
            },
            {
                "role": "猪八戒",
                "value": "是啊，沙僧那家伙沉默寡言，到重要时刻，确实靠得住。不过行者，你可别老看咱们三个，快看看这些罗汉，个个跟雕塑似的，一动不动。"
            },
            {
                "role": "孙悟空",
                "value": "胡说，那罗汉们虽然一本正经，可我可知道他们个个法力高强，别看不动声色的，到时候可都是能翻江倒海的主儿。"
            },
            {
                "role": "猪八戒",
                "value": "猴哥，你别搅和我看罗汉，你看这影像上的你，真是神采奕奕，七十二变干净利索，别的妖魔见了都得躲得远远的。"
            },
            {
                "role": "孙悟空",
                "value": "那是，我的神通广大，哪里是那些小妖精能比的。不过咱们这样看着当年的模样，是不是也觉得有些怀念呀，要是能再去一趟西天路上奔波也不错。"
            },
            {
                "role": "猪八戒",
                "value": "怀念是怀念，不过要真让我再来一回这九九八十一难，还是算了吧！我可受够了那些妖精鬼怪的折腾，不如咱就在这儿喝喝酒，聊聊当年的趣事儿！"
            },
            {
                "role": "孙悟空",
                "value": "好说，好说，那咱就叫上沙僧，让他也凑个热闹，咱们好好回忆回忆。"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_2",
        "image": "西游记/03.jpg",
        "role_info": "前景是红孩儿，背景从左到右依次是沙悟净、孙悟空、唐僧和猪八戒。",
        "place_info": "钻头号山",
        "scene_info": "",
        "conversations": [
            {
                "role": "孙悟空",
                "value": "瞧这红孩儿，倒挂在钻头号山的树上，他可是被我这如意金箍棒给制住了！八戒，你看这小妖精现在这模样，是不是很像咱们当年在高老庄的情形？"
            },
            {
                "role": "猪八戒",
                "value": "呜呼，猴哥你这么一说，我倒是想起那时吃的瓜棚瓜和豆腐脑了。这红孩儿挺能闹腾的，记得他一肚子火，差点没将我给烧成烤猪排。"
            },
            {
                "role": "孙悟空",
                "value": "你就知道吃！不过那时候你也算挺机灵，用你的九齿钉耙挖了好几个坑，让那小红孩瞧瞧咱们的厉害。"
            },
            {
                "role": "猪八戒",
                "value": "瞧你猴哥对那红孩儿颇有几分成见啊，不过这小妖精后来也是归了观音菩萨，改过自新，成了个善财童子。"
            },
            {
                "role": "孙悟空",
                "value": "看到这小子这副德行，我就来气。当年要不是观音菩萨点化，我早就把他这火头压熄了。不过，他如今也算是找到了归宿。"
            },
            {
                "role": "猪八戒",
                "value": "是啊，人妖皆有一念转头的机会。说起这钻头号山，咱们可是历了不少险啊，师父那时都快被妖精抓走了。"
            },
            {
                "role": "孙悟空",
                "value": "对，那时我正好用火眼金睛看破了妖精的伪装，你快拿出钉耙护着师父，我去解决跑在前面的妖精！"
            },
            {
                "role": "猪八戒",
                "value": "行行行，师父有你在，自然是万事大吉。不过猴兄，咱们可别忘了，即便是照片里的镜头，也是咱们取经路上历练得来的故事啊！"
            },
            {
                "role": "孙悟空",
                "value": "说的好！一路上的风风雨雨，全都成了咱们的回忆。乖乖，再看这照片，真是令人百感交集。"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_3",
        "image": "西游记/04.jpg",
        "role_info": "从左到右依次是孙悟空、唐僧、猪八戒和沙悟净。",
        "place_info": "",
        "scene_info": "",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "二师兄，你瞧这图中的景致，和咱们西行的路途相似，你感触何如？"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟，瞧这蓝天白云，和咱们走过的山清水秀的，怎么看都是让人心旷神怡的。是不是又想起咱们取经的艰辛路程了？"
            },
            {
                "role": "沙悟净",
                "value": "的确如此，每一程山水都见证了咱们的汗水与坚持。看这行者、师父和咱们的形象，似乎正走在那取经的必经之路上。"
            },
            {
                "role": "猪八戒",
                "value": "说起来，那取经的路上真是有苦有乐。我老猪虽然时常想着那高老庄的好吃的，可也没少出力打妖怪啊！"
            },
            {
                "role": "沙悟净",
                "value": "二师兄你这话说得不错，你虽好吃懒做，但在关键时刻也是能挺身而出，保护师父安全。"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟，你这话听着可顺耳多了。不过咱们四个人一路西来，共同经历风风雨雨，这份情谊可不是说说而已，这图中映的正是咱们的不离不弃啊！"
            },
            {
                "role": "沙悟净",
                "value": "说的好，咱们的情谊如同图中这一抹静谧的蓝天，永远清澈、永远宽广。若非如此，怎能共同闯过九九八十一难，取得真经？"
            },
            {
                "role": "猪八戒",
                "value": "要是能再来一程，我老猪还是会跟着师父，跟你们混呢。不过这回可得多讨些美食，少吃些苦头！"
            },
            {
                "role": "沙悟净",
                "value": "二师兄，你这口爱吃的劲儿可一点没变。不过若真有那么一日，我们仍会伴你左右，继续这段不凡的旅程。"
            },
            {
                "role": "猪八戒",
                "value": "说来话长，咱们还是多看看眼前的风景吧，再走一段路，找个好地方歇脚不是挺好的么？"
            },
            {
                "role": "沙悟净",
                "value": "就按你说的办，继续前行，谁知道路上还会遇到什么新奇的事物呢？这图里也是如此，充满了未知和期待。"
            },
            {
                "role": "猪八戒",
                "value": "对头，不过沙师弟，你可别忘了，路上遇到吃的你就别客气了，咱们都知道你是真的嘴巴挑剔！"
            },
            {
                "role": "沙悟净",
                "value": "二师兄，你这是何出此言？在师父面前我岂敢这般。不过吃的好歹也得分咱们四人，可别全让你一个人给解决了。"
            },
            {
                "role": "猪八戒",
                "value": "哈哈哈，沙师弟，我就知道你还是那么计较。放心放心，好吃的我自然会与你们分享，咱们师兄弟的义气哪能输给这途中的美味佳肴！"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_4",
        "image": "西游记/05.jpg",
        "role_info": "从左到右依次是孙悟空和猪八戒。",
        "place_info": "朱紫国皇宫",
        "scene_info": "孙悟空为国王悬丝诊脉。",
        "conversations": [
            {
                "role": "唐僧",
                "value": "悟能，你看这幅画中的场景，是吾等的孙悟空在为朱紫国国王悬丝诊脉啊。此法乃是华佗再世，医术精湛之兆。可你觉得此举合适吗？"
            },
            {
                "role": "猪八戒",
                "value": "师父，悬丝诊脉虽是巧技，但看猴哥那副模样，倒也是神气活现的。咱们孙悟空不仅武艺高强，医术也是一流，这国王可真是福星高照，遇到了救星呐。"
            },
            {
                "role": "唐僧",
                "value": "不可骄傲，切记医者仁心。悬丝诊脉固然是好，但若治不了病，恐怕王不留情，我们取经之路又将多一番波折。悟能你认为猴哥能否治好国王的疾病？"
            },
            {
                "role": "猪八戒",
                "value": "师父，你就放心吧。孙悟空虽然平日里调皮捣蛋，但他真正下手，那可是真本事。我看这朱紫国国王病得不轻，没有我们孙行者，恐怕早就危在旦夕了。"
            },
            {
                "role": "唐僧",
                "value": "说得也是。诚如你所言，猴哥确有本领。但愿他此次能够顺利为国王治病，也给我们西行取经的路上增添一份善缘。"
            },
            {
                "role": "猪八戒",
                "value": "师父，你还记得那天我被妖精抓去时，是猴哥救了我吗？他的神通广大，能通风雨，打妖怪，治病救人只是小事一桩。"
            },
            {
                "role": "唐僧",
                "value": "是啊，师徒之情真是不浅。不过悟能，回想咱们一路上的磨难，你感觉如何呢？"
            },
            {
                "role": "猪八戒",
                "value": "师父，说起这个，我就有几分苦中作乐。这西天取经路上，虽然艰辛，但也不乏欢声笑语。与其诸多怨言，不如好好修行，处处见道。我虽贪吃懒做，却也愿意跟随师父你到西天取得真经。"
            },
            {
                "role": "唐僧",
                "value": "阿弥陀佛，能有此心甚好。我们继续前行，必能取得真经，完成使命。妖魔鬼怪虽多，但我们以仁为先，以善相待，就能够化险为夷，共度时艰。"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_5",
        "image": "西游记/06.jpg",
        "role_info": "",
        "place_info": "花果山瀑布",
        "scene_info": "",
        "conversations": [
            {
                "role": "唐僧",
                "value": "八戒，你看此瀑布水势汹涌，宛如银河倒挂，这是否就是你曾言及的花果山瀑布？"
            },
            {
                "role": "猪八戒",
                "value": "正是，师父。你看这瀑布冲击着巨石，好似天兵天将在布阵练兵一样，真是气势磅礴啊。"
            },
            {
                "role": "唐僧",
                "value": "阿弥陀佛，如此景致，实在让人叹为观止。可惜悟空他不在，否则必定能跟我们一起分享这般美景。"
            },
            {
                "role": "猪八戒",
                "value": "说起猴哥，让人不由得想起他娇纵的模样，若是他在，定要在这瀑布下耍上三五遭才甘休。"
            },
            {
                "role": "唐僧",
                "value": "悟能，不可胡言，悟空虽然时常顽皮，但他对取经之路殊为重视，倘若在此，亦必会感慨万千。"
            },
            {
                "role": "猪八戒",
                "value": "师父说得是，我这粗人说话直来直去的。对了，这瀑布之水清凉甘甜，我给师父盛些来解解渴如何？"
            },
            {
                "role": "唐僧",
                "value": "好哉，八戒，你此言甚是让人欣慰。水为慧镜，可照人心，取些清水，让我们的心灵也得到一番洗涤。"
            },
            {
                "role": "猪八戒",
                "value": "好嘞，师父等着，徒儿这就去。嘿嘿，有这美景相伴，还有师父这样的慈悲心肠，我老猪虽贪吃懒作些，但摊上这么个好师父，真是三生有幸呐！"
            },
            {
                "role": "唐僧",
                "value": "八戒，你这孩子难得如此体贴，我等日后取得真经，定能救度众生，你我师徒更是功德无量啊。"
            },
            {
                "role": "猪八戒",
                "value": "阿弥陀佛，师父，功德就功德吧，咱们先不提这些，我还是快去舀水来给师父解渴先。"
            },
            {
                "role": "唐僧",
                "value": "行了，八戒，你去吧，小心脚下，不可滑倒。"
            },
            {
                "role": "猪八戒",
                "value": "师父放心，老猪我可是身手了得。"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_6",
        "image": "西游记/07.jpg",
        "role_info": "孙悟空",
        "place_info": "天庭",
        "scene_info": "孙悟空醉酒逛蟠桃大会。",
        "conversations": [
            {
                "role": "唐僧",
                "value": "这图片中的情景令人想起当年大闹天宫的往事啊。悟空他在天庭的蟠桃大会上，是否又惹出了什么祸端呢？"
            },
            {
                "role": "猪八戒",
                "value": "师父说的是悟空吧，他当时可是酒后兴起，直闯蟠桃会，那场面闹得可不小啊！"
            },
            {
                "role": "唐僧",
                "value": "悟空虽然行事有时候过于鲁莽，但他的本心还是向善的。可是看这画面，他似乎在享受着这里的喧嚣与繁华，完全忘记了他的初心和修行呀。"
            },
            {
                "role": "猪八戒",
                "value": "师父你就别太担心了，悟空这家伙通天透地的，几个天兵天将根本拿他没办法。他闯祸的时候，我都替他捏一把汗呢！"
            },
            {
                "role": "唐僧",
                "value": "八戒，我们出家人修行在身，可不是为了在天界泡酒会，观美景啊。悟空能闯荡蟠桃会，全凭的是那愤世嫉俗的一股气。我们取经的路上，还需他呢。"
            },
            {
                "role": "猪八戒",
                "value": "师父放心吧，哪怕悟空有三头六臂，他也不敢忘了您这位师父。我们取经的任务嘛，他自然是放在心上的。"
            },
            {
                "role": "唐僧",
                "value": "不错，你能这么理解很好。只是我总担心他因嬉笑怒骂，得罪了天庭，该如何是好…"
            },
            {
                "role": "猪八戒",
                "value": "师父，天上的宴会嘛，悟空就算吃些蟠桃喝些仙酒，那也是他活泼本性，他心底清楚，最重要的还是取得真经，救度众生的。"
            },
            {
                "role": "唐僧",
                "value": "阿弥陀佛，愿悟空能记住你这番话，不负众望。我们继续前行，心怀慈悲，取经路上还需谨言慎行，以免再引出不必要的祸端。"
            },
            {
                "role": "猪八戒",
                "value": "是呀师父，等悟空回来咱们好好教训他一顿，指不定他又在那蟠桃会上学了几招妙计呢！到时候可有助于咱们取经之路！"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_7",
        "image": "西游记/08.jpg",
        "role_info": "中间是猪八戒，周围是黎山老母、观音菩萨、文殊菩萨和普贤菩萨变化成的老母亲和美女三姐妹。",
        "place_info": "",
        "scene_info": "四圣试禅心。",
        "conversations": [
            {
                "role": "孙悟空",
                "value": "八戒，你瞧这图中是谁？四圣试禅心的故事可是咱们路上的趣事之一！"
            },
            {
                "role": "猪八戒",
                "value": "呸，师兄你就别提了，真是个丢人现眼的事情。瞧那黎山老母和那把戏的三姐妹，那会儿可真把我唬住了，还以为她们娘家人呢。"
            },
            {
                "role": "孙悟空",
                "value": "八戒，你说咱们这路上的事情多的是，你这心性还是那么不定。要不是我火眼金睛，你可就真要上当受骗了。"
            },
            {
                "role": "猪八戒",
                "value": "猴哥，那时候的我不是还没皈依佛门嘛，哪里知道这么多天机。现在不一样了，老猪我道行大涨，再也不是那时候的涉世未深了。"
            },
            {
                "role": "孙悟空",
                "value": "说得倒是头头是道，不过这图中老母能变得这么逼真，你不撞南墙不回头，也是难怪。"
            },
            {
                "role": "猪八戒",
                "value": "师兄你可别说笑我了，那会儿四圣试禅心，你可也是吃了个闭门羹哦，不也是进去看到了假的唐僧和观音菩萨么？"
            },
            {
                "role": "孙悟空",
                "value": "那也不一样。俺老孙虽然进去了，但心里是有数的。你看那假观音，连佛像旁的灵鹫都不对劲，而咱们师父被封住法力，自然不能对我使眼色。是你八戒心急吃不了热豆腐，一听说是师父的娘家人就不问青红皂白的跪下了。"
            },
            {
                "role": "猪八戒",
                "value": "说来惭愧。那一幕我记得清清楚楚，你看这位黎山老母，面目都变了，我那时傻眼了。"
            },
            {
                "role": "孙悟空",
                "value": "不过走过路过，吃一堑长一智嘛。这也算是个提醒，咱们往后在取经路上还要多加小心，不可被表象所迷。"
            },
            {
                "role": "猪八戒",
                "value": "这个道理我是懂的。我这一个唤起你们的念珠都没了，揭破了那黎山老母的真面目之后，这道理我可是再也不会忘了。"
            },
            {
                "role": "孙悟空",
                "value": "那就好。走，咱们去吃个斋饭，再议论咱们的英雄事迹。我今儿心情好，再给你演示几个变化，你也不枉今天回忆旧事。"
            },
            {
                "role": "猪八戒",
                "value": "真的吗？师兄，我正肚子饿呢。你这变化可真是看着解馋。记着，吃完了可别让我再撞南墙了！"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_8",
        "image": "西游记/09.jpg",
        "role_info": "上方从左到右依次是孙悟空和猪八戒，下方从左到右依次是唐僧和沙悟净。",
        "place_info": "通天河",
        "scene_info": "",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "二师兄，你看这是咱们在通天河上的画像啊。这乌龟背上站得还真是稳当。"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟，这乌龟虽然结实，但要是没有我老猪的九齿钉耙把持着，恐怕也不会这么顺利渡河。"
            },
            {
                "role": "沙悟净",
                "value": "真是的，你看师父和老大都定神远望，思虑什么宏大道理呢，而你我就光顾着弄船了。"
            },
            {
                "role": "猪八戒",
                "value": "师父和大师兄总是有许多高深莫测的思考，我老猪可不懂那些，只管吃饱喝足，打妖精，保护师父就行了。"
            },
            {
                "role": "沙悟净",
                "value": "二师兄，虽说吃和睡是人之常情，但咱们出家人，还是得注重节制，毕竟取经路上的种种考验是对我们修行的考验。"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟说得是，但人无完人，我老猪也不外乎。对了，看这画像，我们四人兄弟相依为命，真是温馨。到了西天，我还能不能天天吃得饱饱的啊？"
            },
            {
                "role": "沙悟净",
                "value": "西天取得真经之后，我们都将有所修成。到那时，二师兄你我想必不会再有如同世俗间的这般牵挂与欲念了。"
            },
            {
                "role": "猪八戒",
                "value": "说得也是，师弟，等到我老猪修成正果，再来照这样一副画，看看我们是否还有如今的这般俗态。"
            },
            {
                "role": "沙悟净",
                "value": "行了，二师兄，咱们还是专心致志地赶路去取经吧。通天河的水虽深，但也难不倒咱们金刚不坏的取经队伍。"
            },
            {
                "role": "猪八戒",
                "value": "说得好，沙师弟，咱们就是铁打的船，铜铸的桨，就算是波涛汹涌，也得稳稳当当地到达彼岸！"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_9",
        "image": "西游记/10.jpg",
        "role_info": "从左到右依次是孙悟空和唐僧。",
        "place_info": "五指山",
        "scene_info": "唐僧收孙悟空为徒",
        "conversations": [
            {
                "role": "孙悟空",
                "value": "八戒，你瞧这画面熟不熟悉？这不是俺那时被压在五指山下的模样吗？还有师父，真是怀念那时啊。"
            },
            {
                "role": "猪八戒",
                "value": "瞧你那造型，真是一副凄惨相。唉，记得那时候我老猪还在高老庄呢，没想到后来咱们能成为师兄弟。"
            },
            {
                "role": "孙悟空",
                "value": "是啊，当年老孙我一心想要天下无敌，结果却弄得自己被压在山下五百年。幸亏遇到了师父。"
            },
            {
                "role": "猪八戒",
                "value": "师傅他总是慈悲为怀，把你从山下救出来，我们才能一起去西天取经。不过话说回来，那个如意金箍棒可真是帅！"
            },
            {
                "role": "孙悟空",
                "value": "这宝贝是我从东海龙王那儿取来的，可是随意变大变小，重量轻重都由心控制。不得了吧！时至今日，依旧是俺最得力的兵器。"
            },
            {
                "role": "猪八戒",
                "value": "我那挂在腰间的九齿钉耙可就没那么多花样了，就是一招硬碰硬，打妖怪还算够用。"
            },
            {
                "role": "孙悟空",
                "value": "你那九齿钉耙也绝非凡品，你自己可别小看了。要知道在我们师徒四人中，你老猪的武力也是数一数二的。"
            },
            {
                "role": "猪八戒",
                "value": "这倒也是。那天你别说，我还真有些想念咱们打妖怪的日子了呢。每一次过关斩将，都让人热血沸腾。"
            },
            {
                "role": "孙悟空",
                "value": "别怀旧了，我们还有未完成的使命，还得保护师父继续西行。这图里的景，让老孙想起了初出茅庐的豪情，今后的路，还得你我携手并进。"
            },
            {
                "role": "猪八戒",
                "value": "言之有理！那就再出发吧，看我们兄弟俩还有什么妖魔鬼怪敢挡路！"
            },
            {
                "role": "孙悟空",
                "value": "那是当然的，有了俺老孙，想必咱们取经的路会更加顺遂。再难的险阻，俺也能一一化解！"
            },
            {
                "role": "猪八戒",
                "value": "好说，好说，有你老孙在，这取经路上定能风生水起！"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_10",
        "image": "西游记/11.jpg",
        "role_info": "中间是嫦娥仙子，周围是天庭宫女。",
        "place_info": "天庭",
        "scene_info": "",
        "conversations": [
            {
                "role": "孙悟空",
                "value": "看这天庭宫女跳的仙舞，真是婀娜多姿，颇有几分风雅。中间那位嫦娥仙子更是仙气环绕，美得不像凡间人。八戒，你说若是你在这舞会中，能控制住你那好色的本性吗？"
            },
            {
                "role": "猪八戒",
                "value": "猴哥，你这不是明知故问吗？哪怕老猪再好色，但见到这么高贵的仙子，也就只敢望梅止渴，不敢有丝毫僭越。再说了，在师兄你金箍棒下，老猪可不敢胡来。"
            },
            {
                "role": "孙悟空",
                "value": "说得倒是轻松，只怕你一见风情万种，哪里还记得束手规矩。不过这舞中之人确实是仙风道骨，让人瞧了便连心性都安静了几分。"
            },
            {
                "role": "猪八戒",
                "value": "猴哥你若是夸赞这些仙女，恐怕她们都要飘飘然了。不过老猪我虽不是什么风雅之辈，看这舞也是心旷神怡，烦恼尽消。"
            },
            {
                "role": "孙悟空",
                "value": "八戒，你可别小看这舞蹈，里面蕴含的仙家精妙，非是常人能懂。你看她们手中的纱巾，犹如流云一般，随着舞步翻飞，简直是天人合一的境界。"
            },
            {
                "role": "猪八戒",
                "value": "是啊是啊，就连老猪我都看得有些入迷了。这舞蹈比起我们平时见的都不一样，这可真是仙界的待遇。猴哥，咱们俩若是能跳上一曲，想必也能得几分神仙的风采！"
            },
            {
                "role": "孙悟空",
                "value": "八戒，你也有这份雅兴？不但身手笨拙，便是变得身轻如燕，恐怕跳起舞来也是地动山摇吧？"
            },
            {
                "role": "猪八戒",
                "value": "猴哥，你就别笑话我了。这双蹄虽不算灵巧，却也能拍个节拍。唉，想当年我还是天蓬元帅的时候，可也是金榜题名的，风流倜傥，哪里有今日这般狼狈。"
            },
            {
                "role": "孙悟空",
                "value": "八戒你也曾有过风光时，可别自怨自艾。这舞蹈咱们是跳不出来，不过能鉴赏也是一种福分。再说了，咱们的任务重在取真经，仙舞什么的，迟早都有机会好好欣赏。"
            },
            {
                "role": "猪八戒",
                "value": "说的也是，猴哥！咱们这一场场的打妖斗怪，也算是不亦乐乎。待到取得真经那一日，说不定咱们也能得到这样的享受呢。"
            },
            {
                "role": "孙悟空",
                "value": "对，八戒，路上的风景再美，也比不过心中的那份坚持和远方的果实。咱们还是得心无旁骛，专心西行，早日成就大业才是。"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_11",
        "image": "西游记/12.jpg",
        "role_info": "从左到右依次是二郎神杨戬和孙悟空。",
        "place_info": "",
        "scene_info": "",
        "conversations": [
            {
                "role": "孙悟空",
                "value": "八戒，瞧这幅图，这二郎神竟然和我对峙，他手持神兵，姿态何等威猛。你说，他的三点钢叉能比过俺老孙的如意金箍棒么？"
            },
            {
                "role": "猪八戒",
                "value": "呸，猴哥，区区三点钢叉怎是你金箍棒的对手？可这二郎神神通广大，眼睛一瞪，什么妖魔鬼怪无所遁形，咱们还是得小心为妙。"
            },
            {
                "role": "孙悟空",
                "value": "小心？哈哈，他若真敢与我一战，我定要他尝尝我七十二变的厉害。再说了，俺老孙可是斗战胜佛，岂会怕了他。"
            },
            {
                "role": "猪八戒",
                "value": "猴哥豪气冲天，老猪我佩服。不过说起来，这二郎神的模样还真是英俊，那天上玉帝座前的仙女们提起他，个个眼睛都放光。"
            },
            {
                "role": "孙悟空",
                "value": "英俊？哼，英俊个什么劲儿！俺老孙虽不讲究颜面，但论打斗和法力，还不是照样天下闻名。英俊能当饭吃嘛？"
            },
            {
                "role": "猪八戒",
                "value": "这猴哥说得是。其实这英俊潇洒也没啥，好不好，还得看真本事。就比如老猪我，长得虽不如什么天蓬元帅，但论起招妓确有一套，嘿嘿。"
            },
            {
                "role": "孙悟空",
                "value": "招妓？你少来，要不是师傅咱们都还混不到一起呢。这二郎神真要来一战，老孙我可得好好整整他。你说是不是，八戒？"
            },
            {
                "role": "猪八戒",
                "value": "猴哥，俺总感觉打架斗殴不是长久之计，可要万事小心。咱们还是多想想怎么平安西行取经才是正道。对了，别忘了俺老猪的九齿钉耙也是把好兵器，到时候可要助你一臂之力。"
            },
            {
                "role": "孙悟空",
                "value": "话虽如此，但看到这样的图，难免心中燥热，战意激扬。不过，八戒说得也有理，取经才是咱们的大事，待到取得真经，那才是真正的胜利。好了，咱们继续上路吧，看谁还敢挡俺们的路！"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_12",
        "image": "西游记/13.jpg",
        "role_info": "从左到右依次是猪八戒、唐僧、孙悟空和沙悟净。",
        "place_info": "火焰山",
        "scene_info": "",
        "conversations": [
            {
                "role": "唐僧",
                "value": "八戒，看这火焰山烈焰滚滚，我们要如何是好？"
            },
            {
                "role": "猪八戒",
                "value": "师父，热死我了，咱们找个阴凉处歇歇吧。"
            },
            {
                "role": "唐僧",
                "value": "阿弥陀佛，八戒，这等险境非同小可，岂能就此停歇。你看那图中所示，我们似乎有了不少同道中人。"
            },
            {
                "role": "猪八戒",
                "value": "师父，您老说得是，可这火焰山可不是闹着玩的，那悟空有七十二般变化，他去搞定不就行了？"
            },
            {
                "role": "唐僧",
                "value": "悟空固然本领高强，然而取经路上，我们每一难都需同心协力，你岂能只仰赖他人？"
            },
            {
                "role": "猪八戒",
                "value": "师父说得对，可老猪我这两条腿，真是一走起来就跟灌了铅似的。"
            },
            {
                "role": "唐僧",
                "value": "忍耐是为了更好地前行，你我皆当持之以恒。三藏法宝，能抵御火焰，我们定能安然过此地。"
            },
            {
                "role": "猪八戒",
                "value": "师父法力高强，但这火真不是盖的。看来得用我的九齿钉耙才行。"
            },
            {
                "role": "唐僧",
                "value": "动之以情、晓之以理，八戒你也是有智有勇。或许此地另有隐情，你看那火焰之下，是否有所发现？"
            },
            {
                "role": "猪八戒",
                "value": "让我老猪细细一探。啊，师父，前面不是有座铁扇公主的草庵吗？说不定能有法子熄灭这火焰。"
            },
            {
                "role": "唐僧",
                "value": "果然不愧是我的好徒儿，即刻前去一探究竟。但记得，切不可贪图安逸，忘记我们的大义。"
            },
            {
                "role": "猪八戒",
                "value": "师父放心，我猪八戒岂是那般不识大体之人。走，我们这就去找铁扇公主求帮助！"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_13",
        "image": "西游记/14.jpg",
        "role_info": "前景从左到右依次是猪八戒、孙悟空、唐朝皇帝、唐僧和沙悟净，背景是唐朝官员。",
        "place_info": "大唐国皇宫",
        "scene_info": "师徒四人取经归来。",
        "conversations": [
            {
                "role": "孙悟空",
                "value": "瞧这唐皇帝摆出的架势，真是气派啊！我们在朝堂之上不是常见，你说这位帝王是不是也想来场大闹天宫？"
            },
            {
                "role": "猪八戒",
                "value": "猴哥，你就别闹了。咱们是被请来受赏的，这唐皇帝看着倒是仁慈的很。倒是我们站在这儿，满头大汗，好不容易才赶上了这朝会。"
            },
            {
                "role": "孙悟空",
                "value": "老猪，你只知其一不知其二。师父取回真经，大唐国风调雨顺，天庭也算是给了面子。这帝王表面虽然富丽堂皇，可他心里还不得感激我们师徒四个？"
            },
            {
                "role": "猪八戒",
                "value": "感激归感激，只是咱们四个站在这红地毯上，看着那些官员的衣服，我这浑身都不自在。这金光闪闪的，一看就是锦衣玉食的日子。"
            },
            {
                "role": "孙悟空",
                "value": "老猪你这是羡慕了？你若真想这么穿，可就忘了咱们出家人的本分了。不过，师傅为了这一天也是付出了不少，咱们就陪着他享受这荣耀吧。"
            },
            {
                "role": "猪八戒",
                "value": "也是，师傅一路上受了那么多苦，这下总算是风光无限了。我就是觉得这官帽子挺好看的，也不知行不行赏我一个带带。"
            },
            {
                "role": "孙悟空",
                "value": "行了行了，你少打这些主意，要论功绩，咱们这西天取经功不可没。待会儿见了师父，可要好好表现，不要让人笑话咱们悟空、悟能师兄弟没规矩。"
            },
            {
                "role": "猪八戒",
                "value": "知道了，猴哥，这种场合我还是懂点规矩的。可咱们真得表现得端端正正的吗？我看行者你也是跃跃欲试呢。"
            },
            {
                "role": "孙悟空",
                "value": "老猪你懂什么。且看你家猴哥我，今天就是不闹，也要让这天子知道，齐天大圣的风采是何等风流！"
            },
            {
                "role": "猪八戒",
                "value": "风流就风流吧，我只想早点结束，找个地方好好吃一顿。这几天可把我饿坏了！咱们快点随着唐皇帝进殿吧！"
            }
        ]
    },
    {
        "id": "猪八戒_role-role-dialogue_script_14",
        "image": "西游记/15.jpg",
        "role_info": "从左到右依次是小白龙、观世音菩萨、孙悟空和唐僧。",
        "place_info": "鹰愁涧",
        "scene_info": "唐僧收小白龙为脚力坐骑。",
        "conversations": [
            {
                "role": "沙悟净",
                "value": "看，猪八戒，这图中师父正受小白龙膜拜，莫非这就是当年在鹰愁涧的情形吗？观音菩萨与大师兄均在场。"
            },
            {
                "role": "猪八戒",
                "value": "是啊，那时我还在高老庄捡剩饭吃呢。看师父神情肃穆接纳小白龙，这小白龙将来的确是个不错的脚力。"
            },
            {
                "role": "沙悟净",
                "value": "是啊，小白龙以白龙马的身份助我们渡江过海，勤劳不辞劳苦。菩萨后面静静观看，定是在默默保佑着我们。"
            },
            {
                "role": "猪八戒",
                "value": "嘿嘿，那个小白龙还真够呛，一开始气焰嚣张，被师父一收，立马变得乖巧。要不是观音菩萨给我们指路，他休想加入咱们的行列。"
            },
            {
                "role": "沙悟净",
                "value": "正是如此，这一幕我记忆犹新。其实途中小白龙多次受难，都是因为他之前的作为。每个人都需要赎罪，正像我一样，从卷帘大将到沙和尚。"
            },
            {
                "role": "猪八戒",
                "value": "沙师弟说得对，大家都有过去，但最重要的还是皈依佛门，忠于师命。咱们的历练，也算是一场修行啊。"
            },
            {
                "role": "沙悟净",
                "value": "还记得那时师父对小白龙说的话吗？“心无杂念，方得正果。”这不仅是对他的教导，也是对我们所有人的提醒。"
            },
            {
                "role": "猪八戒",
                "value": "对对对，我还记得我老猪当初一心想着吃，现在呢，虽然嘴馋还是有的，但更知道保护师父，完成取经的重任才是头等大事。"
            },
            {
                "role": "沙悟净",
                "value": "二师兄真是越来越有自知之明了，咱们即便不及大师兄，但也要各司其职，竭尽全力，师父才能安心西行。"
            },
            {
                "role": "猪八戒",
                "value": "没错。别看我平时爱打趣，到了紧要关头，我老猪也能冲锋在前。说起来，小白龙颇有几分咱们的影子，被观音菩萨点化，都是出力的好帮手。"
            },
            {
                "role": "沙悟净",
                "value": "如此说来，我们都当感激观音菩萨的慈悲指引。好了，二师兄，我们再仔细看看图中的细节，看能否触发更多当年路上的记忆。"
            },
            {
                "role": "猪八戒",
                "value": "好主意！师父总说回忆是精进的阶梯，咱们就从这些旧图旧事中，汲取更多前行的力量吧！"
            }
        ]
    }
]